[Killed] IfNegation
Providers/TelescopeServiceProvider.php:44:9
      */
     private function shouldRecordEntry(IncomingEntry $entry, bool $isLocal): bool
     {
-        if ($isLocal) {
-            return true;
-        }
+        if (!$isLocal) {
         if ($entry->isReportableException()) {
             return true;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:45:13
     private function shouldRecordEntry(IncomingEntry $entry, bool $isLocal): bool
     {
         if ($isLocal) {
-            return true;
+            
         }
         if ($entry->isReportableException()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] TrueValue
Providers/TelescopeServiceProvider.php:45:13
     private function shouldRecordEntry(IncomingEntry $entry, bool $isLocal): bool
     {
         if ($isLocal) {
-            return true;
+            return false;
         }
         if ($entry->isReportableException()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] IfNegation
Providers/TelescopeServiceProvider.php:47:9
         if ($isLocal) {
             return true;
         }
-        if ($entry->isReportableException()) {
-            return true;
-        }
+        if (!$entry->isReportableException()) {
         if ($entry->isFailedRequest()) {
             return true;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] TrueValue
Providers/TelescopeServiceProvider.php:48:13
             return true;
         }
         if ($entry->isReportableException()) {
-            return true;
+            return false;
         }
         if ($entry->isFailedRequest()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:48:13
             return true;
         }
         if ($entry->isReportableException()) {
-            return true;
+            
         }
         if ($entry->isFailedRequest()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] IfNegation
Providers/TelescopeServiceProvider.php:50:9
         if ($entry->isReportableException()) {
             return true;
         }
-        if ($entry->isFailedRequest()) {
-            return true;
-        }
+        if (!$entry->isFailedRequest()) {
         if ($entry->isFailedJob()) {
             return true;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] TrueValue
Providers/TelescopeServiceProvider.php:51:13
             return true;
         }
         if ($entry->isFailedRequest()) {
-            return true;
+            return false;
         }
         if ($entry->isFailedJob()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:51:13
             return true;
         }
         if ($entry->isFailedRequest()) {
-            return true;
+            
         }
         if ($entry->isFailedJob()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] IfNegation
Providers/TelescopeServiceProvider.php:53:9
         if ($entry->isFailedRequest()) {
             return true;
         }
-        if ($entry->isFailedJob()) {
-            return true;
-        }
+        if (!$entry->isFailedJob()) {
         if ($entry->isScheduledTask()) {
             return true;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] TrueValue
Providers/TelescopeServiceProvider.php:54:13
             return true;
         }
         if ($entry->isFailedJob()) {
-            return true;
+            return false;
         }
         if ($entry->isScheduledTask()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:54:13
             return true;
         }
         if ($entry->isFailedJob()) {
-            return true;
+            
         }
         if ($entry->isScheduledTask()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] IfNegation
Providers/TelescopeServiceProvider.php:56:9
         if ($entry->isFailedJob()) {
             return true;
         }
-        if ($entry->isScheduledTask()) {
-            return true;
-        }
+        if (!$entry->isScheduledTask()) {
 
         return $entry->hasMonitoredTag();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:57:13
             return true;
         }
         if ($entry->isScheduledTask()) {
-            return true;
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] TrueValue
Providers/TelescopeServiceProvider.php:57:13
             return true;
         }
         if ($entry->isScheduledTask()) {
-            return true;
+            return false;
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.

[Killed] ReturnRemoval
Providers/TelescopeServiceProvider.php:69:13
     private function hideSensitiveRequestDetails(): void
     {
         if ($this->app->environment('local')) {
-            return;
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/TelescopeServiceProviderTest.php" not found.
