[Killed] PublicVisibility
Console/Commands/DependencyReviewPerformanceReport.php:29:5
 
     protected $description = 'Summarise dependency review runtime metrics and append evidence logs for QA.';
 
-    public function handle(): int
+    protected function handle(): int
     {
         $disk = Storage::disk('local');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewPerformanceReport.php:34:9
         $disk = Storage::disk('local');
         $reportPath = $this->option('report');
 
-        if (! is_string($reportPath) || $reportPath === '') {
+        if (is_string($reportPath) || $reportPath === '') {
             try {
                 $reportPath = $this->resolveLatestReport();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] Identical
Console/Commands/DependencyReviewPerformanceReport.php:34:9
         $disk = Storage::disk('local');
         $reportPath = $this->option('report');
 
-        if (! is_string($reportPath) || $reportPath === '') {
+        if (!is_string($reportPath) || $reportPath !== '') {
             try {
                 $reportPath = $this->resolveLatestReport();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:38:17
             try {
                 $reportPath = $this->resolveLatestReport();
             } catch (RuntimeException $exception) {
-                $this->components->error($exception->getMessage());
+                
 
                 return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/DependencyReviewPerformanceReport.php:40:17
             } catch (RuntimeException $exception) {
                 $this->components->error($exception->getMessage());
 
-                return self::FAILURE;
+                
             }
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewPerformanceReport.php:44:9
             }
         }
 
-        if (! $disk->exists($reportPath)) {
+        if ($disk->exists($reportPath)) {
             $this->components->error(sprintf('Dependency review report [%s] could not be found.', $reportPath));
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:45:13
         }
 
         if (! $disk->exists($reportPath)) {
-            $this->components->error(sprintf('Dependency review report [%s] could not be found.', $reportPath));
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:57:13
                 flags: JSON_THROW_ON_ERROR
             );
         } catch (JsonException $exception) {
-            $this->components->error(sprintf('Dependency review report [%s] contains invalid JSON: %s', $reportPath, $exception->getMessage()));
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewPerformanceReport.php:62:9
             return self::FAILURE;
         }
 
-        if (! is_array($report)) {
+        if (is_array($report)) {
             $this->components->error(sprintf('Dependency review report [%s] must decode to an array.', $reportPath));
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:63:13
         }
 
         if (! is_array($report)) {
-            $this->components->error(sprintf('Dependency review report [%s] must decode to an array.', $reportPath));
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:78:9
             'issue_template' => $report['issue_template'] ?? null,
         ];
 
-        $disk->append(
-            self::PERFORMANCE_LOG,
-            json_encode($entry, JSON_THROW_ON_ERROR)
-        );
+        
 
         $this->components->info(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:83:9
             json_encode($entry, JSON_THROW_ON_ERROR)
         );
 
-        $this->components->info(sprintf(
-            'Dependency review performance entry recorded for %s.',
-            $reportPath
-        ));
+        
 
         $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] OneZeroFloat
Console/Commands/DependencyReviewPerformanceReport.php:88:9
             $reportPath
         ));
 
-        $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
+        $runtimeSeconds = $entry['runtime_seconds'] ?? 1.0;
         $runtimeFloat = is_numeric($runtimeSeconds) ? (float) $runtimeSeconds : 0.0;
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] Coalesce
Console/Commands/DependencyReviewPerformanceReport.php:88:9
             $reportPath
         ));
 
-        $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
+        $runtimeSeconds = 0.0 ?? $entry['runtime_seconds'];
         $runtimeFloat = is_numeric($runtimeSeconds) ? (float) $runtimeSeconds : 0.0;
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] Ternary
Console/Commands/DependencyReviewPerformanceReport.php:89:9
         ));
 
         $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
-        $runtimeFloat = is_numeric($runtimeSeconds) ? (float) $runtimeSeconds : 0.0;
+        $runtimeFloat = is_numeric($runtimeSeconds) ? 0.0 : (float) $runtimeSeconds;
 
         BasePlatformMetrics::record('dependency_review_performance', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] CastFloat
Console/Commands/DependencyReviewPerformanceReport.php:89:9
         ));
 
         $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
-        $runtimeFloat = is_numeric($runtimeSeconds) ? (float) $runtimeSeconds : 0.0;
+        $runtimeFloat = is_numeric($runtimeSeconds) ? $runtimeSeconds : 0.0;
 
         BasePlatformMetrics::record('dependency_review_performance', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:91:9
         $runtimeSeconds = $entry['runtime_seconds'] ?? 0.0;
         $runtimeFloat = is_numeric($runtimeSeconds) ? (float) $runtimeSeconds : 0.0;
 
-        BasePlatformMetrics::record('dependency_review_performance', [
-            'status' => $entry['status'],
-            'overdue_count' => $entry['overdue_count'],
-        ], $runtimeFloat);
+        
 
         return self::SUCCESS;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportTest.php" not found.

[Killed] LogicalAnd
Console/Commands/DependencyReviewPerformanceReport.php:104:13
         $disk = Storage::disk('local');
 
         $files = collect($disk->files(self::REPORT_DIRECTORY))
-            ->filter(fn (mixed $path): bool => is_string($path) && Str::endsWith($path, '.json'))
+            $files = collect($disk->files(self::REPORT_DIRECTORY))->filter(fn(mixed $path): bool => is_string($path) || Str::endsWith($path, '.json'))->sortDesc()->values();
             ->sortDesc()
             ->values();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Console/Commands/DependencyReviewPerformanceReport.php:104:13
         $disk = Storage::disk('local');
 
         $files = collect($disk->files(self::REPORT_DIRECTORY))
-            ->filter(fn (mixed $path): bool => is_string($path) && Str::endsWith($path, '.json'))
+            $files = collect($disk->files(self::REPORT_DIRECTORY))->filter(fn(mixed $path): bool => is_string($path) && !Str::endsWith($path, '.json'))->sortDesc()->values();
             ->sortDesc()
             ->values();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.

[Killed] FunctionCallRemoval
Console/Commands/DependencyReviewPerformanceReport.php:108:9
             ->sortDesc()
             ->values();
 
-        throw_if($files->isEmpty(), RuntimeException::class, 'No dependency review reports are present in storage.');
+        
 
         /** @var string $firstFile */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewPerformanceReportFailuresTest.php" not found.
