[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:51:13
         $overdue = $catalogue->overdue($now);
 
         $severityCounts = [
-            'critical' => 0,
+            $severityCounts = ['critical' => -1, 'high' => 0, 'medium' => 0, 'low' => 0];
             'high' => 0,
             'medium' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:51:13
         $overdue = $catalogue->overdue($now);
 
         $severityCounts = [
-            'critical' => 0,
+            $severityCounts = ['critical' => 1, 'high' => 0, 'medium' => 0, 'low' => 0];
             'high' => 0,
             'medium' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:52:13
 
         $severityCounts = [
             'critical' => 0,
-            'high' => 0,
+            $severityCounts = ['critical' => 0, 'high' => -1, 'medium' => 0, 'low' => 0];
             'medium' => 0,
             'low' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:52:13
 
         $severityCounts = [
             'critical' => 0,
-            'high' => 0,
+            $severityCounts = ['critical' => 0, 'high' => 1, 'medium' => 0, 'low' => 0];
             'medium' => 0,
             'low' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:53:13
         $severityCounts = [
             'critical' => 0,
             'high' => 0,
-            'medium' => 0,
+            $severityCounts = ['critical' => 0, 'high' => 0, 'medium' => 1, 'low' => 0];
             'low' => 0,
         ];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:53:13
         $severityCounts = [
             'critical' => 0,
             'high' => 0,
-            'medium' => 0,
+            $severityCounts = ['critical' => 0, 'high' => 0, 'medium' => -1, 'low' => 0];
             'low' => 0,
         ];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:54:13
             'critical' => 0,
             'high' => 0,
             'medium' => 0,
-            'low' => 0,
+            $severityCounts = ['critical' => 0, 'high' => 0, 'medium' => 0, 'low' => -1];
         ];
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:54:13
             'critical' => 0,
             'high' => 0,
             'medium' => 0,
-            'low' => 0,
+            $severityCounts = ['critical' => 0, 'high' => 0, 'medium' => 0, 'low' => 1];
         ];
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewReport.php:62:9
 
         $result = $this->auditRunner->run();
 
-        if (! $result->successful()) {
+        if ($result->successful()) {
             $auditStatus = 'fail';
             $auditError = mb_trim($result->errorOutput()) !== '' ? mb_trim($result->errorOutput()) : $result->output();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Console/Commands/DependencyReviewReport.php:64:13
 
         if (! $result->successful()) {
             $auditStatus = 'fail';
-            $auditError = mb_trim($result->errorOutput()) !== '' ? mb_trim($result->errorOutput()) : $result->output();
+            $auditError = mb_trim($result->errorOutput()) !== '' ? $result->output() : mb_trim($result->errorOutput());
         } else {
             $decoded = json_decode($result->output(), true);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewReport.php:68:13
         } else {
             $decoded = json_decode($result->output(), true);
 
-            if (! is_array($decoded)) {
+            if (is_array($decoded)) {
                 $auditStatus = 'fail';
                 $auditError = 'Composer audit returned malformed JSON output.';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Console/Commands/DependencyReviewReport.php:73:17
                 $auditError = 'Composer audit returned malformed JSON output.';
             } else {
                 $advisoriesRaw = Arr::get($decoded, 'advisories', []);
-                $advisories = is_array($advisoriesRaw) ? $advisoriesRaw : [];
+                $advisories = is_array($advisoriesRaw) ? [] : $advisoriesRaw;
                 /** @var array<int, array<string, mixed>> $advisoriesTyped */
                 $advisoriesTyped = array_filter($advisories, is_array(...));
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalOrNegation
Console/Commands/DependencyReviewReport.php:78:17
                 $advisoriesTyped = array_filter($advisories, is_array(...));
                 $severityCounts = $this->tallySeverities($advisoriesTyped);
 
-                if ($severityCounts['critical'] > 0 || $severityCounts['high'] > 0) {
+                if (!($severityCounts['critical'] > 0 || $severityCounts['high'] > 0)) {
                     $auditStatus = 'fail';
                 } elseif ($severityCounts['medium'] > 0 || $overdue->isNotEmpty()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] GreaterThanNegotiation
Console/Commands/DependencyReviewReport.php:78:17
                 $advisoriesTyped = array_filter($advisories, is_array(...));
                 $severityCounts = $this->tallySeverities($advisoriesTyped);
 
-                if ($severityCounts['critical'] > 0 || $severityCounts['high'] > 0) {
+                if ($severityCounts['critical'] > 0 || $severityCounts['high'] <= 0) {
                     $auditStatus = 'fail';
                 } elseif ($severityCounts['medium'] > 0 || $overdue->isNotEmpty()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalOrSingleSubExprNegation
Console/Commands/DependencyReviewReport.php:80:17
 
                 if ($severityCounts['critical'] > 0 || $severityCounts['high'] > 0) {
                     $auditStatus = 'fail';
-                } elseif ($severityCounts['medium'] > 0 || $overdue->isNotEmpty()) {
+                } elseif ($severityCounts['medium'] > 0 || !$overdue->isNotEmpty()) {
                     $auditStatus = 'warn';
                 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] GreaterThanNegotiation
Console/Commands/DependencyReviewReport.php:80:17
 
                 if ($severityCounts['critical'] > 0 || $severityCounts['high'] > 0) {
                     $auditStatus = 'fail';
-                } elseif ($severityCounts['medium'] > 0 || $overdue->isNotEmpty()) {
+                } elseif ($severityCounts['medium'] <= 0 || $overdue->isNotEmpty()) {
                     $auditStatus = 'warn';
                 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:88:9
 
         $reportPath = $this->determineOutputPath($now);
 
-        $disk->makeDirectory(self::DEFAULT_REPORT_DIRECTORY);
+        
 
         $report = [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] BitwiseOr
Console/Commands/DependencyReviewReport.php:102:9
             'error' => $auditError,
         ];
 
-        $json = json_encode($report, JSON_PRETTY_PRINT | JSON_THROW_ON_ERROR);
+        $json = json_encode($report, JSON_PRETTY_PRINT & JSON_THROW_ON_ERROR);
 
         $disk->put($reportPath, $json);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:104:9
 
         $json = json_encode($report, JSON_PRETTY_PRINT | JSON_THROW_ON_ERROR);
 
-        $disk->put($reportPath, $json);
+        
 
         File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Concat
Console/Commands/DependencyReviewReport.php:106:9
 
         $disk->put($reportPath, $json);
 
-        File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
+        File::ensureDirectoryExists(storage_path(dirname($reportPath) . 'app/'));
         File::put(storage_path('app/'.$reportPath), $json);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:106:9
 
         $disk->put($reportPath, $json);
 
-        File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
+        File::ensureDirectoryExists(storage_path(dirname($reportPath)));
         File::put(storage_path('app/'.$reportPath), $json);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:107:9
         $disk->put($reportPath, $json);
 
         File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
-        File::put(storage_path('app/'.$reportPath), $json);
+        File::put(storage_path($reportPath), $json);
 
         if (app()->runningUnitTests()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:107:9
         $disk->put($reportPath, $json);
 
         File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
-        File::put(storage_path('app/'.$reportPath), $json);
+        File::put(storage_path('app/'), $json);
 
         if (app()->runningUnitTests()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IfNegation
Console/Commands/DependencyReviewReport.php:109:9
         File::ensureDirectoryExists(storage_path('app/'.dirname($reportPath)));
         File::put(storage_path('app/'.$reportPath), $json);
 
-        if (app()->runningUnitTests()) {
-            $testingRoot = storage_path('framework/testing/disks/local');
-
-            File::ensureDirectoryExists($testingRoot.'/'.dirname($reportPath));
-            File::put($testingRoot.'/'.$reportPath, $json);
-        }
+        if (!app()->runningUnitTests()) {
 
         $this->components->info(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:112:13
         if (app()->runningUnitTests()) {
             $testingRoot = storage_path('framework/testing/disks/local');
 
-            File::ensureDirectoryExists($testingRoot.'/'.dirname($reportPath));
+            File::ensureDirectoryExists($testingRoot . dirname($reportPath));
             File::put($testingRoot.'/'.$reportPath, $json);
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:112:13
         if (app()->runningUnitTests()) {
             $testingRoot = storage_path('framework/testing/disks/local');
 
-            File::ensureDirectoryExists($testingRoot.'/'.dirname($reportPath));
+            File::ensureDirectoryExists('/' . dirname($reportPath));
             File::put($testingRoot.'/'.$reportPath, $json);
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ConcatOperandRemoval
Console/Commands/DependencyReviewReport.php:113:13
             $testingRoot = storage_path('framework/testing/disks/local');
 
             File::ensureDirectoryExists($testingRoot.'/'.dirname($reportPath));
-            File::put($testingRoot.'/'.$reportPath, $json);
+            File::put('/' . $reportPath, $json);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Concat
Console/Commands/DependencyReviewReport.php:113:13
             $testingRoot = storage_path('framework/testing/disks/local');
 
             File::ensureDirectoryExists($testingRoot.'/'.dirname($reportPath));
-            File::put($testingRoot.'/'.$reportPath, $json);
+            File::put($testingRoot . $reportPath . '/', $json);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:116:9
             File::put($testingRoot.'/'.$reportPath, $json);
         }
 
-        $this->components->info(sprintf(
-            'Dependency review report generated: storage/app/%s',
-            $reportPath
-        ));
+        
 
         if ($overdue->isNotEmpty()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IfNegation
Console/Commands/DependencyReviewReport.php:121:9
             $reportPath
         ));
 
-        if ($overdue->isNotEmpty()) {
-            $this->components->warn(sprintf(
-                'Overdue dependencies detected: %s',
-                $overdue->map(fn (DependencyRecordData $entry): string => $entry->name)->implode(', ')
-            ));
-        }
+        if (!$overdue->isNotEmpty()) {
 
         if ($auditError !== null) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:122:13
         ));
 
         if ($overdue->isNotEmpty()) {
-            $this->components->warn(sprintf(
-                'Overdue dependencies detected: %s',
-                $overdue->map(fn (DependencyRecordData $entry): string => $entry->name)->implode(', ')
-            ));
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] NotIdentical
Console/Commands/DependencyReviewReport.php:128:9
             ));
         }
 
-        if ($auditError !== null) {
+        if ($auditError === null) {
             $this->components->error($auditError);
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:129:13
         }
 
         if ($auditError !== null) {
-            $this->components->error($auditError);
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:132:9
             $this->components->error($auditError);
         }
 
-        BasePlatformMetrics::record('dependency_review_status', [
-            'status' => $auditStatus,
-            'overdue_count' => $overdue->count(),
-            'critical' => $severityCounts['critical'],
-            'high' => $severityCounts['high'],
-            'medium' => $severityCounts['medium'],
-            'low' => $severityCounts['low'],
-        ]);
+        
 
         BasePlatformMetrics::record('dependency_review_runtime_seconds', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:141:9
             'low' => $severityCounts['low'],
         ]);
 
-        BasePlatformMetrics::record('dependency_review_runtime_seconds', [
-            'status' => $auditStatus,
-        ], $report['runtime_seconds']);
+        
 
         return $auditError === null ? self::SUCCESS : self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ArrayItemRemoval
Console/Commands/DependencyReviewReport.php:141:9
             'low' => $severityCounts['low'],
         ]);
 
-        BasePlatformMetrics::record('dependency_review_runtime_seconds', [
-            'status' => $auditStatus,
-        ], $report['runtime_seconds']);
+        BasePlatformMetrics::record('dependency_review_runtime_seconds', [], $report['runtime_seconds']);
 
         return $auditError === null ? self::SUCCESS : self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Console/Commands/DependencyReviewReport.php:145:9
             'status' => $auditStatus,
         ], $report['runtime_seconds']);
 
-        return $auditError === null ? self::SUCCESS : self::FAILURE;
+        return $auditError === null ? self::FAILURE : self::SUCCESS;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:155:13
     private function tallySeverities(array $advisories): array
     {
         $counts = [
-            'critical' => 0,
+            $counts = ['critical' => -1, 'high' => 0, 'medium' => 0, 'low' => 0];
             'high' => 0,
             'medium' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:155:13
     private function tallySeverities(array $advisories): array
     {
         $counts = [
-            'critical' => 0,
+            $counts = ['critical' => 1, 'high' => 0, 'medium' => 0, 'low' => 0];
             'high' => 0,
             'medium' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:156:13
     {
         $counts = [
             'critical' => 0,
-            'high' => 0,
+            $counts = ['critical' => 0, 'high' => -1, 'medium' => 0, 'low' => 0];
             'medium' => 0,
             'low' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:156:13
     {
         $counts = [
             'critical' => 0,
-            'high' => 0,
+            $counts = ['critical' => 0, 'high' => 1, 'medium' => 0, 'low' => 0];
             'medium' => 0,
             'low' => 0,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:157:13
         $counts = [
             'critical' => 0,
             'high' => 0,
-            'medium' => 0,
+            $counts = ['critical' => 0, 'high' => 0, 'medium' => 1, 'low' => 0];
             'low' => 0,
         ];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:157:13
         $counts = [
             'critical' => 0,
             'high' => 0,
-            'medium' => 0,
+            $counts = ['critical' => 0, 'high' => 0, 'medium' => -1, 'low' => 0];
             'low' => 0,
         ];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] DecrementInteger
Console/Commands/DependencyReviewReport.php:158:13
             'critical' => 0,
             'high' => 0,
             'medium' => 0,
-            'low' => 0,
+            $counts = ['critical' => 0, 'high' => 0, 'medium' => 0, 'low' => -1];
         ];
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Console/Commands/DependencyReviewReport.php:158:13
             'critical' => 0,
             'high' => 0,
             'medium' => 0,
-            'low' => 0,
+            $counts = ['critical' => 0, 'high' => 0, 'medium' => 0, 'low' => 1];
         ];
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/DependencyReviewReport.php:161:9
             'low' => 0,
         ];
 
-        Collection::make($advisories)
-            ->each(function (array $advisory) use (&$counts): void {
-                $severityValue = $advisory['severity'] ?? 'low';
-                $severity = mb_strtolower(is_string($severityValue) ? $severityValue : 'low');
-
-                if (! array_key_exists($severity, $counts)) {
-                    $severity = 'low';
-                }
-
-                $counts[$severity]++;
-            });
+        
 
         return $counts;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Console/Commands/DependencyReviewReport.php:163:17
 
         Collection::make($advisories)
             ->each(function (array $advisory) use (&$counts): void {
-                $severityValue = $advisory['severity'] ?? 'low';
+                $severityValue = 'low' ?? $advisory['severity'];
                 $severity = mb_strtolower(is_string($severityValue) ? $severityValue : 'low');
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Console/Commands/DependencyReviewReport.php:164:17
         Collection::make($advisories)
             ->each(function (array $advisory) use (&$counts): void {
                 $severityValue = $advisory['severity'] ?? 'low';
-                $severity = mb_strtolower(is_string($severityValue) ? $severityValue : 'low');
+                $severity = mb_strtolower(is_string($severityValue) ? 'low' : $severityValue);
 
                 if (! array_key_exists($severity, $counts)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalNot
Console/Commands/DependencyReviewReport.php:166:17
                 $severityValue = $advisory['severity'] ?? 'low';
                 $severity = mb_strtolower(is_string($severityValue) ? $severityValue : 'low');
 
-                if (! array_key_exists($severity, $counts)) {
+                if (array_key_exists($severity, $counts)) {
                     $severity = 'low';
                 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Increment
Console/Commands/DependencyReviewReport.php:170:17
                     $severity = 'low';
                 }
 
-                $counts[$severity]++;
+                $counts[$severity]--;
             });
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalAndNegation
Console/Commands/DependencyReviewReport.php:180:9
     {
         $option = $this->option('output');
 
-        if (is_string($option) && $option !== '') {
+        if (!(is_string($option) && $option !== '')) {
             return mb_ltrim($option, '/');
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] NotIdentical
Console/Commands/DependencyReviewReport.php:180:9
     {
         $option = $this->option('output');
 
-        if (is_string($option) && $option !== '') {
+        if (is_string($option) && $option === '') {
             return mb_ltrim($option, '/');
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/DependencyReviewReport.php:181:13
         $option = $this->option('output');
 
         if (is_string($option) && $option !== '') {
-            return mb_ltrim($option, '/');
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.
