[Killed] Ternary
Console/Commands/PolicyChecksumMonitor.php:22:9
     public function handle(): int
     {
         $expectedChecksum = Config::get('base-platform.policy.acknowledgement_checksum');
-        $expected = is_string($expectedChecksum) ? $expectedChecksum : '';
+        $expected = is_string($expectedChecksum) ? '' : $expectedChecksum;
 
         $filesConfig = Config::get('base-platform.policy.files', []);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] Ternary
Console/Commands/PolicyChecksumMonitor.php:25:9
         $expected = is_string($expectedChecksum) ? $expectedChecksum : '';
 
         $filesConfig = Config::get('base-platform.policy.files', []);
-        $files = Collection::make(is_array($filesConfig) ? $filesConfig : []);
+        $files = Collection::make(is_array($filesConfig) ? [] : $filesConfig);
 
         $missing = collect();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] LogicalNot
Console/Commands/PolicyChecksumMonitor.php:31:13
         $mismatched = collect();
 
         $files->each(function (mixed $relative) use ($expected, $missing, $mismatched): void {
-            if (! is_string($relative)) {
+            if (is_string($relative)) {
                 return;
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/PolicyChecksumMonitor.php:32:17
 
         $files->each(function (mixed $relative) use ($expected, $missing, $mismatched): void {
             if (! is_string($relative)) {
-                return;
+                
             }
             $path = base_path($relative);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] LogicalNot
Console/Commands/PolicyChecksumMonitor.php:36:13
             }
             $path = base_path($relative);
 
-            if (! File::exists($path)) {
+            if (File::exists($path)) {
                 $missing->push($relative);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:37:17
             $path = base_path($relative);
 
             if (! File::exists($path)) {
-                $missing->push($relative);
+                
 
                 return;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] PregMatchRemoveFlags
Console/Commands/PolicyChecksumMonitor.php:45:13
             $contents = File::get($path);
 
             $matches = [];
-            if (preg_match('/Compliant with \[\.ai\/AI-GUIDELINES.md\]\(.+?\) v([a-f0-9]+)/i', $contents, $matches) !== 1) {
+            if (preg_match('/Compliant with \[\.ai\/AI-GUIDELINES.md\]\(.+?\) v([a-f0-9]+)/', $contents, $matches) !== 1) {
                 $missing->push($relative);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] NotIdentical
Console/Commands/PolicyChecksumMonitor.php:45:13
             $contents = File::get($path);
 
             $matches = [];
-            if (preg_match('/Compliant with \[\.ai\/AI-GUIDELINES.md\]\(.+?\) v([a-f0-9]+)/i', $contents, $matches) !== 1) {
+            if (preg_match('/Compliant with \[\.ai\/AI-GUIDELINES.md\]\(.+?\) v([a-f0-9]+)/i', $contents, $matches) === 1) {
                 $missing->push($relative);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:46:17
 
             $matches = [];
             if (preg_match('/Compliant with \[\.ai\/AI-GUIDELINES.md\]\(.+?\) v([a-f0-9]+)/i', $contents, $matches) !== 1) {
-                $missing->push($relative);
+                
 
                 return;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] IncrementInteger
Console/Commands/PolicyChecksumMonitor.php:51:13
                 return;
             }
 
-            $actual = $matches[1];
+            $actual = $matches[2];
 
             if ($actual !== $expected) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] DecrementInteger
Console/Commands/PolicyChecksumMonitor.php:51:13
                 return;
             }
 
-            $actual = $matches[1];
+            $actual = $matches[0];
 
             if ($actual !== $expected) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] NotIdentical
Console/Commands/PolicyChecksumMonitor.php:53:13
 
             $actual = $matches[1];
 
-            if ($actual !== $expected) {
+            if ($actual === $expected) {
                 $mismatched->push([
                     'file' => $relative,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:54:17
             $actual = $matches[1];
 
             if ($actual !== $expected) {
-                $mismatched->push([
-                    'file' => $relative,
-                    'checksum' => $actual,
-                ]);
+                
             }
         });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] ArrayItemRemoval
Console/Commands/PolicyChecksumMonitor.php:54:17
             $actual = $matches[1];
 
             if ($actual !== $expected) {
-                $mismatched->push([
-                    'file' => $relative,
-                    'checksum' => $actual,
-                ]);
+                $mismatched->push(['checksum' => $actual]);
             }
         });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:61:9
             }
         });
 
-        $this->components->info('Policy acknowledgement checksum summary');
+        
         $this->line(sprintf('- Expected checksum: %s', $expected));
         $this->line(sprintf('- Files scanned: %d', $files->count()));
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:62:9
         });
 
         $this->components->info('Policy acknowledgement checksum summary');
-        $this->line(sprintf('- Expected checksum: %s', $expected));
+        
         $this->line(sprintf('- Files scanned: %d', $files->count()));
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:63:9
 
         $this->components->info('Policy acknowledgement checksum summary');
         $this->line(sprintf('- Expected checksum: %s', $expected));
-        $this->line(sprintf('- Files scanned: %d', $files->count()));
+        
 
         if ($missing->isNotEmpty()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] IfNegation
Console/Commands/PolicyChecksumMonitor.php:65:9
         $this->line(sprintf('- Expected checksum: %s', $expected));
         $this->line(sprintf('- Files scanned: %d', $files->count()));
 
-        if ($missing->isNotEmpty()) {
-            $this->components->error('Missing or malformed acknowledgement headers detected:');
-            $missing->each(function (mixed $file): void {
-                if (is_string($file)) {
-                    $this->line(" • {$file}");
-                }
-            });
-        }
+        if (!$missing->isNotEmpty()) {
 
         if ($mismatched->isNotEmpty()) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:66:13
         $this->line(sprintf('- Files scanned: %d', $files->count()));
 
         if ($missing->isNotEmpty()) {
-            $this->components->error('Missing or malformed acknowledgement headers detected:');
+            
             $missing->each(function (mixed $file): void {
                 if (is_string($file)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:67:13
 
         if ($missing->isNotEmpty()) {
             $this->components->error('Missing or malformed acknowledgement headers detected:');
-            $missing->each(function (mixed $file): void {
-                if (is_string($file)) {
-                    $this->line(" • {$file}");
-                }
-            });
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] IfNegation
Console/Commands/PolicyChecksumMonitor.php:68:17
         if ($missing->isNotEmpty()) {
             $this->components->error('Missing or malformed acknowledgement headers detected:');
             $missing->each(function (mixed $file): void {
-                if (is_string($file)) {
-                    $this->line(" • {$file}");
-                }
+                if (!is_string($file)) {
             });
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:69:21
             $this->components->error('Missing or malformed acknowledgement headers detected:');
             $missing->each(function (mixed $file): void {
                 if (is_string($file)) {
-                    $this->line(" • {$file}");
+                    
                 }
             });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] IfNegation
Console/Commands/PolicyChecksumMonitor.php:74:9
             });
         }
 
-        if ($mismatched->isNotEmpty()) {
-            $this->components->warn('Checksum drift detected:');
-            $this->processMismatchedEntries($mismatched);
-        }
+        if (!$mismatched->isNotEmpty()) {
 
         $status = $missing->isEmpty() && $mismatched->isEmpty() ? 'pass' : 'fail';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:75:13
         }
 
         if ($mismatched->isNotEmpty()) {
-            $this->components->warn('Checksum drift detected:');
+            
             $this->processMismatchedEntries($mismatched);
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:76:13
 
         if ($mismatched->isNotEmpty()) {
             $this->components->warn('Checksum drift detected:');
-            $this->processMismatchedEntries($mismatched);
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Console/Commands/PolicyChecksumMonitor.php:79:9
             $this->processMismatchedEntries($mismatched);
         }
 
-        $status = $missing->isEmpty() && $mismatched->isEmpty() ? 'pass' : 'fail';
+        $status = $missing->isEmpty() && !$mismatched->isEmpty() ? 'pass' : 'fail';
 
         BasePlatformMetrics::record('policy_checksum_status', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] LogicalAndNegation
Console/Commands/PolicyChecksumMonitor.php:79:9
             $this->processMismatchedEntries($mismatched);
         }
 
-        $status = $missing->isEmpty() && $mismatched->isEmpty() ? 'pass' : 'fail';
+        $status = !($missing->isEmpty() && $mismatched->isEmpty()) ? 'pass' : 'fail';
 
         BasePlatformMetrics::record('policy_checksum_status', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:81:9
 
         $status = $missing->isEmpty() && $mismatched->isEmpty() ? 'pass' : 'fail';
 
-        BasePlatformMetrics::record('policy_checksum_status', [
-            'status' => $status,
-        ]);
+        
 
         return $status === 'pass' ? self::SUCCESS : self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] Ternary
Console/Commands/PolicyChecksumMonitor.php:85:9
             'status' => $status,
         ]);
 
-        return $status === 'pass' ? self::SUCCESS : self::FAILURE;
+        return $status === 'pass' ? self::FAILURE : self::SUCCESS;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:95:9
      */
     private function processMismatchedEntries(Collection $mismatched): void
     {
-        $mismatched->each(function (mixed $entry): void {
-            // Guard against non-array values to satisfy static analysis and runtime safety
-            if (! is_array($entry)) {
-                return;
-            }
-
-            if (isset($entry['file'], $entry['checksum'])) {
-                $file = is_string($entry['file']) ? $entry['file'] : '';
-                $checksum = is_string($entry['checksum']) ? $entry['checksum'] : '';
-                $this->line(sprintf(
-                    ' • %s has checksum %s',
-                    $file,
-                    $checksum
-                ));
-            }
-        });
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] LogicalNot
Console/Commands/PolicyChecksumMonitor.php:97:13
     {
         $mismatched->each(function (mixed $entry): void {
             // Guard against non-array values to satisfy static analysis and runtime safety
-            if (! is_array($entry)) {
+            if (is_array($entry)) {
                 return;
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/PolicyChecksumMonitor.php:98:17
         $mismatched->each(function (mixed $entry): void {
             // Guard against non-array values to satisfy static analysis and runtime safety
             if (! is_array($entry)) {
-                return;
+                
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorTest.php" not found.

[Killed] Ternary
Console/Commands/PolicyChecksumMonitor.php:102:17
             }
 
             if (isset($entry['file'], $entry['checksum'])) {
-                $file = is_string($entry['file']) ? $entry['file'] : '';
+                $file = is_string($entry['file']) ? '' : $entry['file'];
                 $checksum = is_string($entry['checksum']) ? $entry['checksum'] : '';
                 $this->line(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] Ternary
Console/Commands/PolicyChecksumMonitor.php:103:17
 
             if (isset($entry['file'], $entry['checksum'])) {
                 $file = is_string($entry['file']) ? $entry['file'] : '';
-                $checksum = is_string($entry['checksum']) ? $entry['checksum'] : '';
+                $checksum = is_string($entry['checksum']) ? '' : $entry['checksum'];
                 $this->line(sprintf(
                     ' • %s has checksum %s',
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/PolicyChecksumMonitor.php:104:17
             if (isset($entry['file'], $entry['checksum'])) {
                 $file = is_string($entry['file']) ? $entry['file'] : '';
                 $checksum = is_string($entry['checksum']) ? $entry['checksum'] : '';
-                $this->line(sprintf(
-                    ' • %s has checksum %s',
-                    $file,
-                    $checksum
-                ));
+                
             }
         });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/PolicyChecksumMonitorBranchesTest.php" not found.
