[Killed] Identical
Console/Commands/RunParityCheck.php:32:9
     {
         $profiles = $this->determineProfiles();
 
-        if ($profiles === []) {
+        if ($profiles !== []) {
             $this->components->error('No supported profiles registered. Run the BasePlatformSeeder.');
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunParityCheck.php:33:13
         $profiles = $this->determineProfiles();
 
         if ($profiles === []) {
-            $this->components->error('No supported profiles registered. Run the BasePlatformSeeder.');
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunParityCheck.php:40:9
 
         $reports = $this->checker->run($profiles);
 
-        ParityReportData::persistMany($reports)->each(function (ParityResult $result): void {
-            $message = $this->renderStatusMessage($result);
-
-            /** @var ParityStatus $status */
-            $status = $result->getAttribute('status') ?? ParityStatus::Pass;
-            match ($status) {
-                ParityStatus::Pass => $this->components->info($message),
-                ParityStatus::Warning => $this->components->warn($message),
-                default => $this->components->error($message),
-            };
-
-            $issues = $result->getAttribute('issues') ?? [];
-            if (is_array($issues) && $issues !== []) {
-                collect($issues)->each(function (mixed $issue): void {
-                    if (is_string($issue)) {
-                        $this->line(" - {$issue}");
-                    }
-                });
-            }
-        });
+        
 
         return self::SUCCESS;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] Coalesce
Console/Commands/RunParityCheck.php:44:13
             $message = $this->renderStatusMessage($result);
 
             /** @var ParityStatus $status */
-            $status = $result->getAttribute('status') ?? ParityStatus::Pass;
+            $status = ParityStatus::Pass ?? $result->getAttribute('status');
             match ($status) {
                 ParityStatus::Pass => $this->components->info($message),
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] MatchArmRemoval
Console/Commands/RunParityCheck.php:45:13
 
             /** @var ParityStatus $status */
             $status = $result->getAttribute('status') ?? ParityStatus::Pass;
-            match ($status) {
-                ParityStatus::Pass => $this->components->info($message),
-                ParityStatus::Warning => $this->components->warn($message),
-                default => $this->components->error($message),
-            };
+            
 
             $issues = $result->getAttribute('issues') ?? [];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] Coalesce
Console/Commands/RunParityCheck.php:51:13
                 default => $this->components->error($message),
             };
 
-            $issues = $result->getAttribute('issues') ?? [];
+            $issues = [] ?? $result->getAttribute('issues');
             if (is_array($issues) && $issues !== []) {
                 collect($issues)->each(function (mixed $issue): void {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Console/Commands/RunParityCheck.php:52:13
             };
 
             $issues = $result->getAttribute('issues') ?? [];
-            if (is_array($issues) && $issues !== []) {
+            if (!is_array($issues) && $issues !== []) {
                 collect($issues)->each(function (mixed $issue): void {
                     if (is_string($issue)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Console/Commands/RunParityCheck.php:52:13
             };
 
             $issues = $result->getAttribute('issues') ?? [];
-            if (is_array($issues) && $issues !== []) {
+            if (!is_array($issues) && !($issues !== [])) {
                 collect($issues)->each(function (mixed $issue): void {
                     if (is_string($issue)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunParityCheck.php:53:17
 
             $issues = $result->getAttribute('issues') ?? [];
             if (is_array($issues) && $issues !== []) {
-                collect($issues)->each(function (mixed $issue): void {
-                    if (is_string($issue)) {
-                        $this->line(" - {$issue}");
-                    }
-                });
+                
             }
         });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] IfNegation
Console/Commands/RunParityCheck.php:54:21
             $issues = $result->getAttribute('issues') ?? [];
             if (is_array($issues) && $issues !== []) {
                 collect($issues)->each(function (mixed $issue): void {
-                    if (is_string($issue)) {
-                        $this->line(" - {$issue}");
-                    }
+                    if (!is_string($issue)) {
                 });
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunParityCheck.php:55:25
             if (is_array($issues) && $issues !== []) {
                 collect($issues)->each(function (mixed $issue): void {
                     if (is_string($issue)) {
-                        $this->line(" - {$issue}");
+                        
                     }
                 });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Console/Commands/RunParityCheck.php:71:9
     {
         $requested = $this->option('profile');
 
-        if (is_string($requested) && $requested !== '') {
+        if (!is_string($requested) && !($requested !== '')) {
             /** @phpstan-ignore-next-line */
             $query = EnvironmentProfile::query()->supported();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Console/Commands/RunParityCheck.php:71:9
     {
         $requested = $this->option('profile');
 
-        if (is_string($requested) && $requested !== '') {
+        if (!is_string($requested) && $requested !== '') {
             /** @phpstan-ignore-next-line */
             $query = EnvironmentProfile::query()->supported();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/RunParityCheck.php:80:13
                 ->pluck('name')
                 ->all();
 
-            return $result;
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] ArrayOneItem
Console/Commands/RunParityCheck.php:80:13
                 ->pluck('name')
                 ->all();
 
-            return $result;
+            return count($result) > 1 ? array_slice($result, 0, 1, true) : $result;
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] Ternary
Console/Commands/RunParityCheck.php:85:9
 
         $supported = Config::get('base-platform.profiles.supported', []);
 
-        return is_array($supported) ? array_values(array_filter($supported, is_string(...))) : [];
+        return is_array($supported) ? [] : array_values(array_filter($supported, is_string(...)));
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] UnwrapArrayFilter
Console/Commands/RunParityCheck.php:85:9
 
         $supported = Config::get('base-platform.profiles.supported', []);
 
-        return is_array($supported) ? array_values(array_filter($supported, is_string(...))) : [];
+        return is_array($supported) ? array_values($supported) : [];
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunParityCheckTest.php" not found.

[Killed] Ternary
Console/Commands/RunParityCheck.php:91:9
     private function renderStatusMessage(ParityResult $result): string
     {
         $environmentProfile = $result->environmentProfile;
-        $profile = ($environmentProfile !== null) ? $environmentProfile->name : 'unknown';
+        $profile = $environmentProfile !== null ? 'unknown' : $environmentProfile->name;
 
         /** @var ParityStatus $status */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] MatchArmRemoval
Console/Commands/RunParityCheck.php:96:9
         /** @var ParityStatus $status */
         $status = $result->getAttribute('status') ?? ParityStatus::Pass;
 
-        return match ($status) {
-            ParityStatus::Pass => "Parity check passed for {$profile}",
-            ParityStatus::Warning => "Parity check finished with warnings for {$profile}",
-            default => "Parity check failed for {$profile}",
-        };
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.
