[Killed] Ternary
Console/Commands/RunPlatformBootstrap.php:33:9
     {
         $profileOption = $this->option('profile');
         $profileDefault = Config::get('base-platform.profiles.supported.0', 'native');
-        $profile = is_string($profileOption) ? $profileOption : (is_string($profileDefault) ? $profileDefault : 'native');
+        $profile = is_string($profileOption) ? $profileOption : (is_string($profileDefault) ? 'native' : $profileDefault);
 
         $forceCleanOption = $this->option('force-clean');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] Ternary
Console/Commands/RunPlatformBootstrap.php:33:9
     {
         $profileOption = $this->option('profile');
         $profileDefault = Config::get('base-platform.profiles.supported.0', 'native');
-        $profile = is_string($profileOption) ? $profileOption : (is_string($profileDefault) ? $profileDefault : 'native');
+        $profile = is_string($profileOption) ? is_string($profileDefault) ? $profileDefault : 'native' : $profileOption;
 
         $forceCleanOption = $this->option('force-clean');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] Identical
Console/Commands/RunPlatformBootstrap.php:36:9
         $profile = is_string($profileOption) ? $profileOption : (is_string($profileDefault) ? $profileDefault : 'native');
 
         $forceCleanOption = $this->option('force-clean');
-        $forceClean = $forceCleanOption === true;
+        $forceClean = $forceCleanOption !== true;
 
         try {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] CatchBlockRemoval
Console/Commands/RunPlatformBootstrap.php:38:9
         $forceCleanOption = $this->option('force-clean');
         $forceClean = $forceCleanOption === true;
 
-        try {
-            $run = $this->runner->run($profile, $forceClean);
-        } catch (UnsupportedProfileException $exception) {
-            $this->components->error($exception->getMessage());
-
-            return self::FAILURE;
-        } catch (BootstrapRunnerException $exception) {
-            $this->components->error($exception->getMessage());
-            $this->outputGuidance($exception->guidance);
-
-            return self::FAILURE;
-        }
+        
 
         $this->renderSuccessMessage($run);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:41:13
         try {
             $run = $this->runner->run($profile, $forceClean);
         } catch (UnsupportedProfileException $exception) {
-            $this->components->error($exception->getMessage());
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapWorkflowTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:45:13
 
             return self::FAILURE;
         } catch (BootstrapRunnerException $exception) {
-            $this->components->error($exception->getMessage());
+            
             $this->outputGuidance($exception->guidance);
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:46:13
             return self::FAILURE;
         } catch (BootstrapRunnerException $exception) {
             $this->components->error($exception->getMessage());
-            $this->outputGuidance($exception->guidance);
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:51:9
             return self::FAILURE;
         }
 
-        $this->renderSuccessMessage($run);
+        
 
         return self::SUCCESS;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] IfNegation
Console/Commands/RunPlatformBootstrap.php:64:9
             $run->durationMinutes,
         );
 
-        if ($run->isWarning()) {
-            $this->components->warn($message);
-        } else {
-            $this->components->info($message);
-        }
+        if (!$run->isWarning()) {
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:65:13
         );
 
         if ($run->isWarning()) {
-            $this->components->warn($message);
+            
         } else {
             $this->components->info($message);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:67:13
         if ($run->isWarning()) {
             $this->components->warn($message);
         } else {
-            $this->components->info($message);
+            
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapWorkflowTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:73:9
 
     private function outputGuidance(BootstrapRecoveryGuidanceData $guidance): void
     {
-        $this->components->warn($guidance->title);
+        
         $this->line("Documentation: <info>{$guidance->documentation}</info>");
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:74:9
     private function outputGuidance(BootstrapRecoveryGuidanceData $guidance): void
     {
         $this->components->warn($guidance->title);
-        $this->line("Documentation: <info>{$guidance->documentation}</info>");
+        
 
         foreach ($guidance->nextSteps as $index => $step) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] Foreach_
Console/Commands/RunPlatformBootstrap.php:76:9
         $this->components->warn($guidance->title);
         $this->line("Documentation: <info>{$guidance->documentation}</info>");
 
-        foreach ($guidance->nextSteps as $index => $step) {
-            $this->line(sprintf('%d. %s', $index + 1, $step));
-        }
+        foreach ([] as $index => $step) {
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/RunPlatformBootstrap.php:77:13
         $this->line("Documentation: <info>{$guidance->documentation}</info>");
 
         foreach ($guidance->nextSteps as $index => $step) {
-            $this->line(sprintf('%d. %s', $index + 1, $step));
+            
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.

[Killed] Plus
Console/Commands/RunPlatformBootstrap.php:77:13
         $this->line("Documentation: <info>{$guidance->documentation}</info>");
 
         foreach ($guidance->nextSteps as $index => $step) {
-            $this->line(sprintf('%d. %s', $index + 1, $step));
+            $this->line(sprintf('%d. %s', $index - 1, $step));
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.
