[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:32:13
         $profiles = $this->determineProfiles();
 
         if ($profiles === []) {
-            $this->components->error('No profiles found to validate. Seed the Base Platform configuration first.');
+            
 
             return self::FAILURE;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ValidateEnvironmentProfilesTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:39:9
 
         $results = $this->validator->validate($profiles);
 
-        collect($results)->each(function (ProfileValidationResultData $result): void {
-            $message = sprintf('Validation complete for %s', $result->profile);
-
-            if ($result->isFail()) {
-                $this->components->error($message);
-            } elseif ($result->isWarning()) {
-                $this->components->warn($message);
-            } else {
-                $this->components->info($message);
-            }
-
-            collect($result->issues)->each(function (string $issue): void {
-                $this->line(" - {$issue}");
-            });
-        });
+        
 
         return self::SUCCESS;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] IfNegation
Console/Commands/ValidateEnvironmentProfiles.php:42:13
         collect($results)->each(function (ProfileValidationResultData $result): void {
             $message = sprintf('Validation complete for %s', $result->profile);
 
-            if ($result->isFail()) {
-                $this->components->error($message);
-            } elseif ($result->isWarning()) {
-                $this->components->warn($message);
-            } else {
-                $this->components->info($message);
-            }
+            if (!$result->isFail()) {
 
             collect($result->issues)->each(function (string $issue): void {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:43:17
             $message = sprintf('Validation complete for %s', $result->profile);
 
             if ($result->isFail()) {
-                $this->components->error($message);
+                
             } elseif ($result->isWarning()) {
                 $this->components->warn($message);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ValidateEnvironmentProfilesTest.php" not found.

[Killed] ElseIfNegation
Console/Commands/ValidateEnvironmentProfiles.php:44:13
 
             if ($result->isFail()) {
                 $this->components->error($message);
-            } elseif ($result->isWarning()) {
-                $this->components->warn($message);
-            } else {
+            } elseif (!$result->isWarning()) {
                 $this->components->info($message);
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:45:17
             if ($result->isFail()) {
                 $this->components->error($message);
             } elseif ($result->isWarning()) {
-                $this->components->warn($message);
+                
             } else {
                 $this->components->info($message);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapContainerProfileTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:50:13
                 $this->components->info($message);
             }
 
-            collect($result->issues)->each(function (string $issue): void {
-                $this->line(" - {$issue}");
-            });
+            
         });
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] MethodCallRemoval
Console/Commands/ValidateEnvironmentProfiles.php:51:17
             }
 
             collect($result->issues)->each(function (string $issue): void {
-                $this->line(" - {$issue}");
+                
             });
         });
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapContainerProfileTest.php" not found.

[Killed] IfNegation
Console/Commands/ValidateEnvironmentProfiles.php:63:9
      */
     private function determineProfiles(): array
     {
-        if ($this->option('all')) {
-            $supported = Config::get('base-platform.profiles.supported', []);
-
-            return is_array($supported) ? array_values(array_filter($supported, is_string(...))) : [];
-        }
+        if (!$this->option('all')) {
 
         $profileOption = $this->option('profile');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/ValidateEnvironmentProfiles.php:66:13
         if ($this->option('all')) {
             $supported = Config::get('base-platform.profiles.supported', []);
 
-            return is_array($supported) ? array_values(array_filter($supported, is_string(...))) : [];
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ValidateEnvironmentProfilesTest.php" not found.

[Killed] Ternary
Console/Commands/ValidateEnvironmentProfiles.php:70:9
         }
 
         $profileOption = $this->option('profile');
-        $profile = is_string($profileOption) ? $profileOption : '';
+        $profile = is_string($profileOption) ? '' : $profileOption;
 
         if ($profile !== '') {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] NotIdentical
Console/Commands/ValidateEnvironmentProfiles.php:72:9
         $profileOption = $this->option('profile');
         $profile = is_string($profileOption) ? $profileOption : '';
 
-        if ($profile !== '') {
+        if ($profile === '') {
             /** @var array<int, string> */
             /** @phpstan-ignore-next-line */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.

[Killed] ReturnRemoval
Console/Commands/ValidateEnvironmentProfiles.php:75:13
         if ($profile !== '') {
             /** @var array<int, string> */
             /** @phpstan-ignore-next-line */
-            return EnvironmentProfile::query()
-                ->supported()
-                ->where('name', $profile)
-                ->pluck('name')
-                ->all();
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapNativeProfileTest.php" not found.
