[Killed] PublicVisibility
Data/BootstrapRunData.php:22:5
         public array $notes = [],
     ) {}
 
-    public function isSuccessful(): bool
+    protected function isSuccessful(): bool
     {
         return $this->status === BootstrapStatus::Success;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] Identical
Data/BootstrapRunData.php:24:9
 
     public function isSuccessful(): bool
     {
-        return $this->status === BootstrapStatus::Success;
+        return $this->status !== BootstrapStatus::Success;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] PublicVisibility
Data/BootstrapRunData.php:27:5
         return $this->status === BootstrapStatus::Success;
     }
 
-    public function isWarning(): bool
+    protected function isWarning(): bool
     {
         return $this->status === BootstrapStatus::Warning;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.

[Killed] Identical
Data/BootstrapRunData.php:29:9
 
     public function isWarning(): bool
     {
-        return $this->status === BootstrapStatus::Warning;
+        return $this->status !== BootstrapStatus::Warning;
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapWarningTest.php" not found.
