[Killed] PublicVisibility
Data/DependencyRecordData.php:29:5
         public string $notes,
     ) {}
 
-    public function reviewDeadline(): Carbon
+    protected function reviewDeadline(): Carbon
     {
         $date = $this->lastReviewedAt instanceof Carbon
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] InstanceOf_
Data/DependencyRecordData.php:31:9
 
     public function reviewDeadline(): Carbon
     {
-        $date = $this->lastReviewedAt instanceof Carbon
+        $date = !$this->lastReviewedAt instanceof Carbon ? $this->lastReviewedAt : Date::parse($this->lastReviewedAt->toDateTimeString());
             ? $this->lastReviewedAt
             : Date::parse($this->lastReviewedAt->toDateTimeString());
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Data/DependencyRecordData.php:31:9
 
     public function reviewDeadline(): Carbon
     {
-        $date = $this->lastReviewedAt instanceof Carbon
-            ? $this->lastReviewedAt
-            : Date::parse($this->lastReviewedAt->toDateTimeString());
+        $date = $this->lastReviewedAt instanceof Carbon ? Date::parse($this->lastReviewedAt->toDateTimeString()) : $this->lastReviewedAt;TimeString());
 
         $result = match ($this->reviewCadence) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MatchArmRemoval
Data/DependencyRecordData.php:35:9
             ? $this->lastReviewedAt
             : Date::parse($this->lastReviewedAt->toDateTimeString());
 
-        $result = match ($this->reviewCadence) {
-            ReviewCadence::Monthly => $date->copy()->addMonthNoOverflow()->endOfDay(),
-            ReviewCadence::Quarterly => $date->copy()->addMonthsNoOverflow(3)->endOfDay(),
-        };
+        
 
         // Ensure we always return Carbon, not CarbonImmutable
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] IncrementInteger
Data/DependencyRecordData.php:37:13
 
         $result = match ($this->reviewCadence) {
             ReviewCadence::Monthly => $date->copy()->addMonthNoOverflow()->endOfDay(),
-            ReviewCadence::Quarterly => $date->copy()->addMonthsNoOverflow(3)->endOfDay(),
+            ReviewCadence::Quarterly => $date->copy()->addMonthsNoOverflow(4)->endOfDay(),
         };
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] DecrementInteger
Data/DependencyRecordData.php:37:13
 
         $result = match ($this->reviewCadence) {
             ReviewCadence::Monthly => $date->copy()->addMonthNoOverflow()->endOfDay(),
-            ReviewCadence::Quarterly => $date->copy()->addMonthsNoOverflow(3)->endOfDay(),
+            ReviewCadence::Quarterly => $date->copy()->addMonthsNoOverflow(2)->endOfDay(),
         };
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] InstanceOf_
Data/DependencyRecordData.php:42:9
 
         // Ensure we always return Carbon, not CarbonImmutable
         // Date::parse() returns CarbonImmutable when Date::use() is set, so convert explicitly
-        if ($result instanceof CarbonImmutable) {
+        if (!$result instanceof CarbonImmutable) {
             return new Carbon($result->toDateTimeString());
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] ReturnRemoval
Data/DependencyRecordData.php:43:13
         // Ensure we always return Carbon, not CarbonImmutable
         // Date::parse() returns CarbonImmutable when Date::use() is set, so convert explicitly
         if ($result instanceof CarbonImmutable) {
-            return new Carbon($result->toDateTimeString());
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] PublicVisibility
Data/DependencyRecordData.php:50:5
         return $result;
     }
 
-    public function isOverdue(Carbon|CarbonImmutable $reference): bool
+    protected function isOverdue(Carbon|CarbonImmutable $reference): bool
     {
         $carbonRef = $reference instanceof Carbon
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Data/DependencyRecordData.php:52:9
 
     public function isOverdue(Carbon|CarbonImmutable $reference): bool
     {
-        $carbonRef = $reference instanceof Carbon
-            ? $reference
-            : Date::parse($reference->toDateTimeString());
+        $carbonRef = $reference instanceof Carbon ? Date::parse($reference->toDateTimeString()) : $reference;tring());
 
         return $this->reviewDeadline()->lessThanOrEqualTo($carbonRef);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] InstanceOf_
Data/DependencyRecordData.php:52:9
 
     public function isOverdue(Carbon|CarbonImmutable $reference): bool
     {
-        $carbonRef = $reference instanceof Carbon
+        $carbonRef = !$reference instanceof Carbon ? $reference : Date::parse($reference->toDateTimeString());
             ? $reference
             : Date::parse($reference->toDateTimeString());
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.
