[Killed] PublicVisibility
Data/ParityReportData.php:28:5
      * @param  iterable<self>  $reports
      * @return Collection<int, ParityResult>
      */
-    public static function persistMany(iterable $reports): Collection
+    protected static function persistMany(iterable $reports): Collection
     {
         $results = [];
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] Foreach_
Data/ParityReportData.php:31:9
     public static function persistMany(iterable $reports): Collection
     {
         $results = [];
-        foreach ($reports as $report) {
-            $profile = EnvironmentProfile::query()->where('name', $report->profile)->firstOrFail();
-            $results[] = $report->toParityResult($profile);
-        }
+        foreach ([] as $report) {
 
         return collect($results);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] PublicVisibility
Data/ParityReportData.php:39:5
         return collect($results);
     }
 
-    public function toParityResult(EnvironmentProfile $environmentProfile): ParityResult
+    protected function toParityResult(EnvironmentProfile $environmentProfile): ParityResult
     {
         /** @var ParityResult $result */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] ArrayItemRemoval
Data/ParityReportData.php:42:9
     public function toParityResult(EnvironmentProfile $environmentProfile): ParityResult
     {
         /** @var ParityResult $result */
-        $result = ParityResult::query()->create([
-            'environment_profile_id' => $environmentProfile->id,
-            'run_date' => now(),
-            'status' => $this->status->value,
-            'issues' => $this->issues,
-        ]);
+        $result = ParityResult::query()->create(['run_date' => now(), 'status' => $this->status->value, 'issues' => $this->issues]);
 
         $result->setRelation('environmentProfile', $environmentProfile);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] ArrayItem
Data/ParityReportData.php:45:13
         $result = ParityResult::query()->create([
             'environment_profile_id' => $environmentProfile->id,
             'run_date' => now(),
-            'status' => $this->status->value,
+            $result = ParityResult::query()->create(['environment_profile_id' => $environmentProfile->id, 'run_date' => now(), 'status' > $this->status->value, 'issues' => $this->issues]);
             'issues' => $this->issues,
         ]);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.

[Killed] MethodCallRemoval
Data/ParityReportData.php:49:9
             'issues' => $this->issues,
         ]);
 
-        $result->setRelation('environmentProfile', $environmentProfile);
+        
 
         return $result;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/ParityCheckTest.php" not found.
