[Killed] PublicVisibility
Data/ProfileValidationResultData.php:21:5
         public array $issues = [],
     ) {}
 
-    public function isPass(): bool
+    protected function isPass(): bool
     {
         return $this->status === ValidationStatus::Pass;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/ProfileValidationResultTest.php" not found.

[Killed] Identical
Data/ProfileValidationResultData.php:23:9
 
     public function isPass(): bool
     {
-        return $this->status === ValidationStatus::Pass;
+        return $this->status !== ValidationStatus::Pass;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/ProfileValidationResultTest.php" not found.

[Killed] Identical
Data/ProfileValidationResultData.php:28:9
 
     public function isWarning(): bool
     {
-        return $this->status === ValidationStatus::Warning;
+        return $this->status !== ValidationStatus::Warning;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/ProfileValidationResultTest.php" not found.

[Killed] PublicVisibility
Data/ProfileValidationResultData.php:31:5
         return $this->status === ValidationStatus::Warning;
     }
 
-    public function isFail(): bool
+    protected function isFail(): bool
     {
         return $this->status === ValidationStatus::Fail;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/ProfileValidationResultTest.php" not found.

[Killed] Identical
Data/ProfileValidationResultData.php:33:9
 
     public function isFail(): bool
     {
-        return $this->status === ValidationStatus::Fail;
+        return $this->status !== ValidationStatus::Fail;
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/ProfileValidationResultTest.php" not found.
