[Killed] MatchArmRemoval
Enums/Theme.php:14:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::Catppuccin => 'Catppuccin',
-            self::Kanagawa => 'Kanagawa',
-        };
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/AppearanceSettingsTest.php" not found.

[Killed] PublicVisibility
Enums/Theme.php:23:5
     /**
      * @return array<int, ThemeFlavor>
      */
-    public function flavors(): array
+    protected function flavors(): array
     {
         return match ($this) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/ThemeEngineTest.php" not found.

[Killed] MatchArmRemoval
Enums/Theme.php:25:9
      */
     public function flavors(): array
     {
-        return match ($this) {
-            self::Catppuccin => [
-                ThemeFlavor::Latte,
-                ThemeFlavor::Frappe,
-                ThemeFlavor::Macchiato,
-                ThemeFlavor::Mocha,
-            ],
-            self::Kanagawa => [
-                ThemeFlavor::Wave,
-                ThemeFlavor::Dragon,
-                ThemeFlavor::Lotus,
-            ],
-        };
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/ThemeEngineTest.php" not found.
