[Killed] UnwrapUcFirst
Enums/ThemeAccent.php:16:9
 
     public function label(): string
     {
-        return ucfirst($this->value);
+        return $this->value;
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/AppearanceSettingsTest.php" not found.
