[Killed] MatchArmRemoval
Enums/ThemeFlavor.php:22:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::Latte => 'Latte (Light)',
-            self::Frappe => 'Frappé',
-            self::Macchiato => 'Macchiato',
-            self::Mocha => 'Mocha',
-            self::Wave => 'Wave (Default)',
-            self::Dragon => 'Dragon (Deep)',
-            self::Lotus => 'Lotus (Light)',
-        };
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/AppearanceSettingsTest.php" not found.
