[Killed] IfNegation
Http/Controllers/CspReportingController.php:18:9
         /** @var array<string, mixed>|null $report */
         $report = $request->input('csp-report');
 
-        if (is_array($report)) {
-            CspViolation::query()->create([
-                'blocked_uri' => $report['blocked-uri'] ?? null,
-                'document_uri' => $report['document-uri'] ?? null,
-                'violated_directive' => $report['violated-directive'] ?? null,
-                'original_policy' => $report['original-policy'] ?? null,
-                'ip_address' => $request->ip(),
-            ]);
-        }
+        if (!is_array($report)) {
 
         return response()->noContent();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/CspReportingControllerTest.php" not found.

[Killed] MethodCallRemoval
Http/Controllers/CspReportingController.php:19:13
         $report = $request->input('csp-report');
 
         if (is_array($report)) {
-            CspViolation::query()->create([
-                'blocked_uri' => $report['blocked-uri'] ?? null,
-                'document_uri' => $report['document-uri'] ?? null,
-                'violated_directive' => $report['violated-directive'] ?? null,
-                'original_policy' => $report['original-policy'] ?? null,
-                'ip_address' => $request->ip(),
-            ]);
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/CspReportingControllerTest.php" not found.
