[Killed] MethodCallRemoval
Livewire/Actions/Logout.php:18:9
      */
     public function __invoke(): RedirectResponse
     {
-        Auth::guard('web')->logout();
+        
 
         Session::invalidate();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Actions/Logout.php:20:9
     {
         Auth::guard('web')->logout();
 
-        Session::invalidate();
+        
         Session::regenerateToken();
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Actions/Logout.php:21:9
         Auth::guard('web')->logout();
 
         Session::invalidate();
-        Session::regenerateToken();
+        
 
         return new RedirectResponse('/');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.
