[Killed] PublicVisibility
Models/EnvironmentProfile.php:39:5
     /**
      * @return HasMany<ParityResult, $this>
      */
-    public function parityResults(): HasMany
+    protected function parityResults(): HasMany
     {
         return $this->hasMany(ParityResult::class, 'environment_profile_id');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/EnvironmentProfileRelationshipTest.php" not found.

[Killed] ArrayItemRemoval
Models/EnvironmentProfile.php:59:9
      */
     protected function casts(): array
     {
-        return [
-            'runtime_versions' => 'array',
-            'prerequisites' => 'array',
-        ];
+        return ['prerequisites' => 'array'];
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/EnvironmentProfileRelationshipTest.php" not found.
