[Killed] PublicVisibility
Models/ParityResult.php:52:5
     /**
      * @return BelongsTo<EnvironmentProfile, $this>
      */
-    public function environmentProfile(): BelongsTo
+    protected function environmentProfile(): BelongsTo
     {
         return $this->belongsTo(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/ParityResultRelationshipTest.php" not found.

[Killed] ArrayItemRemoval
Models/ParityResult.php:66:9
      */
     protected function casts(): array
     {
-        return [
-            'run_date' => 'datetime',
-            'issues' => 'array',
-            'status' => ParityStatus::class,
-        ];
+        return ['issues' => 'array', 'status' => ParityStatus::class];
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/EnvironmentProfileRelationshipTest.php" not found.
