[Killed] PublicVisibility
Models/WorkflowSuite.php:37:5
     /**
      * @return HasMany<WorkflowSuiteChannel, $this>
      */
-    public function channels(): HasMany
+    protected function channels(): HasMany
     {
         return $this->hasMany(WorkflowSuiteChannel::class);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/WorkflowSuiteTest.php" not found.
