[Killed] PublicVisibility
Models/WorkflowSuiteChannel.php:32:5
     /**
      * @return BelongsTo<WorkflowSuite, $this>
      */
-    public function workflowSuite(): BelongsTo
+    protected function workflowSuite(): BelongsTo
     {
         return $this->belongsTo(WorkflowSuite::class);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Models/WorkflowSuiteChannelTest.php" not found.
