[Killed] PublicVisibility
Policies/Csp/AppPolicy.php:14:5
      *
      * @phpstan-return false
      */
-    public function viewAny(): bool
+    protected function viewAny(): bool
     {
         return false;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Policies/Csp/AppPolicyTest.php" not found.

[Killed] PublicVisibility
Policies/Csp/AppPolicy.php:24:5
      *
      * @phpstan-return false
      */
-    public function view(): bool
+    protected function view(): bool
     {
         return false;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Policies/Csp/AppPolicyTest.php" not found.

[Killed] PublicVisibility
Policies/Csp/AppPolicy.php:64:5
      *
      * @phpstan-return false
      */
-    public function restore(): bool
+    protected function restore(): bool
     {
         return false;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Policies/Csp/AppPolicyTest.php" not found.

[Killed] PublicVisibility
Policies/Csp/AppPolicy.php:74:5
      *
      * @phpstan-return false
      */
-    public function forceDelete(): bool
+    protected function forceDelete(): bool
     {
         return false;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Policies/Csp/AppPolicyTest.php" not found.
