[Killed] MethodCallRemoval
Policies/Csp/StrictPreset.php:46:13
 
         // Optional: Allow Hot Module Replacement (HMR) for local dev
         if (app()->environment('local')) {
-            $policy->add(Directive::CONNECT, 'ws://localhost:5173');
+            
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Policies/Csp/StrictPresetTest.php" not found.
