[Killed] MethodCallRemoval
Providers/AppServiceProvider.php:103:17
                 $rule->letters();
             } else {
                 // In production/staging, require all complexity rules
-                $rule->letters()
-                    ->numbers()
-                    ->symbols()
-                    ->mixedCase();
+                
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/AppServiceProviderTest.php" not found.

[Killed] MethodCallRemoval
Providers/AppServiceProvider.php:110:17
             }
 
             if ($shouldRequireUncompromised) {
-                $rule->uncompromised();
+                
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/AppServiceProviderTest.php" not found.
