[Killed] MethodCallRemoval
Providers/Filament/SupportCustomizationServiceProvider.php:30:13
     public function boot(): void
     {
         Filament::serving(function (): void {
-            $this->onFilamentServing();
+            
         });
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/Filament/SupportCustomizationServiceProviderTest.php" not found.

[Killed] MethodCallRemoval
Providers/Filament/SupportCustomizationServiceProvider.php:44:9
      */
     private function onFilamentServing(): void
     {
-        $this->configureFilamentAssets();
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/Filament/SupportCustomizationServiceProviderTest.php" not found.

[Killed] Continue_
Providers/Filament/SupportCustomizationServiceProvider.php:76:17
 
         foreach (FilamentAsset::getScripts() as $script) {
             if (! $this->shouldMutateScript($script, $targets)) {
-                continue;
+                break;
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/Filament/SupportCustomizationServiceProviderTest.php" not found.

[Killed] MethodCallRemoval
Providers/Filament/SupportCustomizationServiceProvider.php:80:17
             }
 
             if ($this->shouldExcludeScript($script, $excludes)) {
-                $script->loadedOnRequest();
+                
 
                 continue;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.

[Killed] Continue_
Providers/Filament/SupportCustomizationServiceProvider.php:82:17
             if ($this->shouldExcludeScript($script, $excludes)) {
                 $script->loadedOnRequest();
 
-                continue;
+                break;
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.

[Killed] MethodCallRemoval
Providers/Filament/SupportCustomizationServiceProvider.php:90:17
             }
 
             if ($async) {
-                $script->async();
+                
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Providers/Filament/SupportCustomizationServiceProviderTest.php" not found.

[Killed] Foreach_
Providers/Filament/SupportCustomizationServiceProvider.php:103:13
         }
 
         if (! $loadAlpine) {
-            foreach (FilamentAsset::getAlpineComponents() as $component) {
-                $component->loadedOnRequest();
-            }
+            foreach ([] as $component) {
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.

[Killed] MethodCallRemoval
Providers/Filament/SupportCustomizationServiceProvider.php:104:17
 
         if (! $loadAlpine) {
             foreach (FilamentAsset::getAlpineComponents() as $component) {
-                $component->loadedOnRequest();
+                
             }
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.

[Killed] Coalesce
Providers/Filament/SupportCustomizationServiceProvider.php:164:9
 
     private function scriptIdentifier(Js $script): string
     {
-        $package = $script->getPackage() ?? 'app';
+        $package = 'app' ?? $script->getPackage();
 
         return mb_strtolower(sprintf('%s:%s', $package, $script->getId()));
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.

[Killed] MBString
Providers/Filament/SupportCustomizationServiceProvider.php:166:9
     {
         $package = $script->getPackage() ?? 'app';
 
-        return mb_strtolower(sprintf('%s:%s', $package, $script->getId()));
+        return strtolower(sprintf('%s:%s', $package, $script->getId()));
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/DashboardTest.php" not found.
