[Killed] PublicVisibility
Services/BasePlatform/BootstrapRecovery.php:12:5
 
 final class BootstrapRecovery
 {
-    public function missingSecret(string $key): BootstrapRecoveryGuidanceData
+    protected function missingSecret(string $key): BootstrapRecoveryGuidanceData
     {
         $normalized = Str::upper($key);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRecoveryTest.php" not found.

[Killed] PublicVisibility
Services/BasePlatform/BootstrapRecovery.php:27:5
         );
     }
 
-    public function offlineMirror(): BootstrapRecoveryGuidanceData
+    protected function offlineMirror(): BootstrapRecoveryGuidanceData
     {
         return new BootstrapRecoveryGuidanceData(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRecoveryTest.php" not found.
