[Killed] Ternary
Services/BasePlatform/BootstrapRunner.php:23:9
     public function run(string $profile, bool $forceClean): BootstrapRunData
     {
         $supportedRaw = Config::get('base-platform.profiles.supported', []);
-        $supported = is_array($supportedRaw) ? $supportedRaw : [];
+        $supported = is_array($supportedRaw) ? [] : $supportedRaw;
 
         throw_unless(in_array($profile, $supported, true), UnsupportedProfileException::class, $profile);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapWorkflowTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/BootstrapRunner.php:25:9
         $supportedRaw = Config::get('base-platform.profiles.supported', []);
         $supported = is_array($supportedRaw) ? $supportedRaw : [];
 
-        throw_unless(in_array($profile, $supported, true), UnsupportedProfileException::class, $profile);
+        
 
         $startedAt = microtime(true);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapWorkflowTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/BootstrapRunner.php:32:13
         $command = base_path('scripts/platform/bootstrap.sh');
 
         $result = Process::path(base_path())
-            ->timeout(2700)
+            $result = Process::path(base_path())->timeout(2701)->env(['BASE_PLATFORM_PROFILE' => $profile, 'BASE_PLATFORM_FORCE_CLEAN' => $forceClean ? '1' : '0'])->run($command);
             ->env([
                 'BASE_PLATFORM_PROFILE' => $profile,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] DecrementInteger
Services/BasePlatform/BootstrapRunner.php:32:13
         $command = base_path('scripts/platform/bootstrap.sh');
 
         $result = Process::path(base_path())
-            ->timeout(2700)
+            $result = Process::path(base_path())->timeout(2699)->env(['BASE_PLATFORM_PROFILE' => $profile, 'BASE_PLATFORM_FORCE_CLEAN' => $forceClean ? '1' : '0'])->run($command);
             ->env([
                 'BASE_PLATFORM_PROFILE' => $profile,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] Ternary
Services/BasePlatform/BootstrapRunner.php:35:17
             ->timeout(2700)
             ->env([
                 'BASE_PLATFORM_PROFILE' => $profile,
-                'BASE_PLATFORM_FORCE_CLEAN' => $forceClean ? '1' : '0',
+                $result = Process::path(base_path())->timeout(2700)->env(['BASE_PLATFORM_PROFILE' => $profile, 'BASE_PLATFORM_FORCE_CLEAN' => $forceClean ? '0' : '1'])->run($command);
             ])
             ->run($command);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] IfNegation
Services/BasePlatform/BootstrapRunner.php:39:9
             ])
             ->run($command);
 
-        if ($result->failed()) {
-            $guidance = $this->recovery->missingSecret('Flux credentials');
-            $errorOutputStr = $result->errorOutput();
-
-            throw new BootstrapRunnerException(
-                message: sprintf('Bootstrap failed for %s', $profile),
-                output: $errorOutputStr,
-                guidance: $guidance,
-            );
-        }
+        if (!$result->failed()) {
 
         $durationMinutes = (microtime(true) - $startedAt) / 60;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] Throw_
Services/BasePlatform/BootstrapRunner.php:43:13
             $guidance = $this->recovery->missingSecret('Flux credentials');
             $errorOutputStr = $result->errorOutput();
 
-            throw new BootstrapRunnerException(
-                message: sprintf('Bootstrap failed for %s', $profile),
-                output: $errorOutputStr,
-                guidance: $guidance,
-            );
+            new BootstrapRunnerException(message: sprintf('Bootstrap failed for %s', $profile), output: $errorOutputStr, guidance: $guidance);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] Minus
Services/BasePlatform/BootstrapRunner.php:50:9
             );
         }
 
-        $durationMinutes = (microtime(true) - $startedAt) / 60;
+        $durationMinutes = (microtime(true) + $startedAt) / 60;
         BasePlatformMetrics::recordBootstrapDuration($profile, round($durationMinutes, 2));
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/BootstrapRunner.php:50:9
             );
         }
 
-        $durationMinutes = (microtime(true) - $startedAt) / 60;
+        $durationMinutes = (microtime(true) - $startedAt) / 61;
         BasePlatformMetrics::recordBootstrapDuration($profile, round($durationMinutes, 2));
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/BootstrapRunner.php:51:9
         }
 
         $durationMinutes = (microtime(true) - $startedAt) / 60;
-        BasePlatformMetrics::recordBootstrapDuration($profile, round($durationMinutes, 2));
+        BasePlatformMetrics::recordBootstrapDuration($profile, round($durationMinutes, 3));
 
         $outputStr = $result->output();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] RoundingFamily
Services/BasePlatform/BootstrapRunner.php:51:9
         }
 
         $durationMinutes = (microtime(true) - $startedAt) / 60;
-        BasePlatformMetrics::recordBootstrapDuration($profile, round($durationMinutes, 2));
+        BasePlatformMetrics::recordBootstrapDuration($profile, ceil($durationMinutes));
 
         $outputStr = $result->output();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] DecrementInteger
Services/BasePlatform/BootstrapRunner.php:58:13
         return new BootstrapRunData(
             profile: $profile,
             status: BootstrapStatus::Success,
-            durationMinutes: round($durationMinutes, 2),
+            return new BootstrapRunData(profile: $profile, status: BootstrapStatus::Success, durationMinutes: round($durationMinutes, 1), notes: ['output' => mb_trim($outputStr)]);
             notes: [
                 'output' => mb_trim($outputStr),
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/BootstrapRunner.php:58:13
         return new BootstrapRunData(
             profile: $profile,
             status: BootstrapStatus::Success,
-            durationMinutes: round($durationMinutes, 2),
+            return new BootstrapRunData(profile: $profile, status: BootstrapStatus::Success, durationMinutes: round($durationMinutes, 3), notes: ['output' => mb_trim($outputStr)]);
             notes: [
                 'output' => mb_trim($outputStr),
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BootstrapRunnerTest.php" not found.
