[Killed] MethodCallRemoval
Services/BasePlatform/BootstrapRunnerException.php:17:9
         public readonly string $output,
         public readonly BootstrapRecoveryGuidanceData $guidance,
     ) {
-        parent::__construct($message);
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/RunPlatformBootstrapExceptionTest.php" not found.
