[Killed] PublicVisibility
Services/BasePlatform/DependencyCatalogue.php:34:5
     /**
      * @return Collection<int, DependencyRecordData>
      */
-    public function entries(): Collection
+    protected function entries(): Collection
     {
         if (! $this->filesystem->exists(self::CATALOGUE_PATH)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalNot
Services/BasePlatform/DependencyCatalogue.php:36:9
      */
     public function entries(): Collection
     {
-        if (! $this->filesystem->exists(self::CATALOGUE_PATH)) {
+        if ($this->filesystem->exists(self::CATALOGUE_PATH)) {
             throw new RuntimeException(sprintf('Dependency catalogue [%s] is missing', self::CATALOGUE_PATH));
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Throw_
Services/BasePlatform/DependencyCatalogue.php:37:13
     public function entries(): Collection
     {
         if (! $this->filesystem->exists(self::CATALOGUE_PATH)) {
-            throw new RuntimeException(sprintf('Dependency catalogue [%s] is missing', self::CATALOGUE_PATH));
+            new RuntimeException(sprintf('Dependency catalogue [%s] is missing', self::CATALOGUE_PATH));
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/DependencyCatalogue.php:46:9
             flags: JSON_THROW_ON_ERROR
         );
 
-        throw_unless(is_array($raw), InvalidArgumentException::class, 'Dependency catalogue must decode to an array');
+        
 
         return collect($raw)->map(function (mixed $entry): DependencyRecordData {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/DependencyCatalogue.php:49:13
         throw_unless(is_array($raw), InvalidArgumentException::class, 'Dependency catalogue must decode to an array');
 
         return collect($raw)->map(function (mixed $entry): DependencyRecordData {
-            throw_unless(is_array($entry), InvalidArgumentException::class, 'Dependency catalogue entry must be an array');
+            
             /** @var array<string, mixed> $entryTyped */
             $entryTyped = $entry;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/DependencyCatalogue.php:52:13
             throw_unless(is_array($entry), InvalidArgumentException::class, 'Dependency catalogue entry must be an array');
             /** @var array<string, mixed> $entryTyped */
             $entryTyped = $entry;
-            $this->assertValidEntry($entryTyped);
+            
 
             $name = $entryTyped['name'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:54:13
             $entryTyped = $entry;
             $this->assertValidEntry($entryTyped);
 
-            $name = $entryTyped['name'] ?? '';
+            $name = '' ?? $entryTyped['name'];
             $version = $entryTyped['version'] ?? '';
             $classification = $entryTyped['classification'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:55:13
             $this->assertValidEntry($entryTyped);
 
             $name = $entryTyped['name'] ?? '';
-            $version = $entryTyped['version'] ?? '';
+            $version = '' ?? $entryTyped['version'];
             $classification = $entryTyped['classification'] ?? '';
             $owner = $entryTyped['owner'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:56:13
 
             $name = $entryTyped['name'] ?? '';
             $version = $entryTyped['version'] ?? '';
-            $classification = $entryTyped['classification'] ?? '';
+            $classification = '' ?? $entryTyped['classification'];
             $owner = $entryTyped['owner'] ?? '';
             $justification = $entryTyped['justification'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:57:13
             $name = $entryTyped['name'] ?? '';
             $version = $entryTyped['version'] ?? '';
             $classification = $entryTyped['classification'] ?? '';
-            $owner = $entryTyped['owner'] ?? '';
+            $owner = '' ?? $entryTyped['owner'];
             $justification = $entryTyped['justification'] ?? '';
             $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:58:13
             $version = $entryTyped['version'] ?? '';
             $classification = $entryTyped['classification'] ?? '';
             $owner = $entryTyped['owner'] ?? '';
-            $justification = $entryTyped['justification'] ?? '';
+            $justification = '' ?? $entryTyped['justification'];
             $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
             $reviewCadence = $entryTyped['reviewCadence'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:59:13
             $classification = $entryTyped['classification'] ?? '';
             $owner = $entryTyped['owner'] ?? '';
             $justification = $entryTyped['justification'] ?? '';
-            $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
+            $lastReviewedAtRaw = '' ?? $entryTyped['lastReviewedAt'];
             $reviewCadence = $entryTyped['reviewCadence'] ?? '';
             $riskLevel = $entryTyped['riskLevel'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:60:13
             $owner = $entryTyped['owner'] ?? '';
             $justification = $entryTyped['justification'] ?? '';
             $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
-            $reviewCadence = $entryTyped['reviewCadence'] ?? '';
+            $reviewCadence = '' ?? $entryTyped['reviewCadence'];
             $riskLevel = $entryTyped['riskLevel'] ?? '';
             $notes = $entryTyped['notes'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:61:13
             $justification = $entryTyped['justification'] ?? '';
             $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
             $reviewCadence = $entryTyped['reviewCadence'] ?? '';
-            $riskLevel = $entryTyped['riskLevel'] ?? '';
+            $riskLevel = '' ?? $entryTyped['riskLevel'];
             $notes = $entryTyped['notes'] ?? '';
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:62:13
             $lastReviewedAtRaw = $entryTyped['lastReviewedAt'] ?? '';
             $reviewCadence = $entryTyped['reviewCadence'] ?? '';
             $riskLevel = $entryTyped['riskLevel'] ?? '';
-            $notes = $entryTyped['notes'] ?? '';
+            $notes = '' ?? $entryTyped['notes'];
 
             // After validation, enum values are guaranteed to be valid non-empty strings
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Services/BasePlatform/DependencyCatalogue.php:66:13
 
             // After validation, enum values are guaranteed to be valid non-empty strings
-            $reviewCadenceStr = is_string($reviewCadence) && $reviewCadence !== '' ? $reviewCadence : throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string');
+            $reviewCadenceStr = !is_string($reviewCadence) && $reviewCadence !== '' ? $reviewCadence : throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string');
             $riskLevelStr = is_string($riskLevel) && $riskLevel !== '' ? $riskLevel : throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string');
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Services/BasePlatform/DependencyCatalogue.php:66:13
 
             // After validation, enum values are guaranteed to be valid non-empty strings
-            $reviewCadenceStr = is_string($reviewCadence) && $reviewCadence !== '' ? $reviewCadence : throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string');
+            $reviewCadenceStr = is_string($reviewCadence) && $reviewCadence !== '' ? throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string') : $reviewCadence;
             $riskLevelStr = is_string($riskLevel) && $riskLevel !== '' ? $riskLevel : throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string');
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Services/BasePlatform/DependencyCatalogue.php:67:13
             // After validation, enum values are guaranteed to be valid non-empty strings
             $reviewCadenceStr = is_string($reviewCadence) && $reviewCadence !== '' ? $reviewCadence : throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string');
-            $riskLevelStr = is_string($riskLevel) && $riskLevel !== '' ? $riskLevel : throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string');
+            $riskLevelStr = is_string($riskLevel) && $riskLevel !== '' ? throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string') : $riskLevel;
 
             return new DependencyRecordData(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] NotIdentical
Services/BasePlatform/DependencyCatalogue.php:67:13
             // After validation, enum values are guaranteed to be valid non-empty strings
             $reviewCadenceStr = is_string($reviewCadence) && $reviewCadence !== '' ? $reviewCadence : throw new InvalidArgumentException('Dependency entry reviewCadence must be a non-empty string');
-            $riskLevelStr = is_string($riskLevel) && $riskLevel !== '' ? $riskLevel : throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string');
+            $riskLevelStr = is_string($riskLevel) && $riskLevel === '' ? $riskLevel : throw new InvalidArgumentException('Dependency entry riskLevel must be a non-empty string');
 
             return new DependencyRecordData(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] PublicVisibility
Services/BasePlatform/DependencyCatalogue.php:86:5
     /**
      * @return Collection<int, DependencyRecordData>
      */
-    public function overdue(Carbon|CarbonImmutable|null $reference = null): Collection
+    protected function overdue(Carbon|CarbonImmutable|null $reference = null): Collection
     {
         $reference ??= Date::now();
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] AssignCoalesce
Services/BasePlatform/DependencyCatalogue.php:88:9
      */
     public function overdue(Carbon|CarbonImmutable|null $reference = null): Collection
     {
-        $reference ??= Date::now();
+        $reference = Date::now();
 
         return $this->entries()->filter(fn (DependencyRecordData $record): bool => $record->isOverdue($reference));
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Foreach_
Services/BasePlatform/DependencyCatalogue.php:110:9
             'notes',
         ];
 
-        foreach ($required as $key) {
-            if (! array_key_exists($key, $entry)) {
-                throw new InvalidArgumentException(sprintf('Dependency entry missing required key [%s]', $key));
-            }
-        }
+        foreach ([] as $key) {
 
         $classification = $entry['classification'] ?? '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] LogicalNot
Services/BasePlatform/DependencyCatalogue.php:111:13
         ];
 
         foreach ($required as $key) {
-            if (! array_key_exists($key, $entry)) {
+            if (array_key_exists($key, $entry)) {
                 throw new InvalidArgumentException(sprintf('Dependency entry missing required key [%s]', $key));
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Throw_
Services/BasePlatform/DependencyCatalogue.php:112:17
 
         foreach ($required as $key) {
             if (! array_key_exists($key, $entry)) {
-                throw new InvalidArgumentException(sprintf('Dependency entry missing required key [%s]', $key));
+                new InvalidArgumentException(sprintf('Dependency entry missing required key [%s]', $key));
             }
         }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:116:9
             }
         }
 
-        $classification = $entry['classification'] ?? '';
+        $classification = '' ?? $entry['classification'];
         $classificationStr = is_string($classification) ? $classification : '';
         throw_if($classificationStr === '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Services/BasePlatform/DependencyCatalogue.php:117:9
         }
 
         $classification = $entry['classification'] ?? '';
-        $classificationStr = is_string($classification) ? $classification : '';
+        $classificationStr = is_string($classification) ? '' : $classification;
         throw_if($classificationStr === '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
         try {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Identical
Services/BasePlatform/DependencyCatalogue.php:118:9
 
         $classification = $entry['classification'] ?? '';
         $classificationStr = is_string($classification) ? $classification : '';
-        throw_if($classificationStr === '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
+        throw_if($classificationStr !== '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
         try {
             DependencyClassification::from($classificationStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/DependencyCatalogue.php:118:9
 
         $classification = $entry['classification'] ?? '';
         $classificationStr = is_string($classification) ? $classification : '';
-        throw_if($classificationStr === '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
+        
         try {
             DependencyClassification::from($classificationStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/DependencyCatalogue.php:120:13
         $classificationStr = is_string($classification) ? $classification : '';
         throw_if($classificationStr === '', InvalidArgumentException::class, 'Dependency entry classification cannot be empty');
         try {
-            DependencyClassification::from($classificationStr);
+            
         } catch (ValueError $e) {
             throw new InvalidArgumentException(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Throw_
Services/BasePlatform/DependencyCatalogue.php:122:13
         try {
             DependencyClassification::from($classificationStr);
         } catch (ValueError $e) {
-            throw new InvalidArgumentException(sprintf(
-                'Unsupported dependency classification [%s]',
-                $classificationStr
-            ), 0, $e);
+            new InvalidArgumentException(sprintf('Unsupported dependency classification [%s]', $classificationStr), 0, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/DependencyCatalogue.php:125:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported dependency classification [%s]',
                 $classificationStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported dependency classification [%s]', $classificationStr), 1, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] DecrementInteger
Services/BasePlatform/DependencyCatalogue.php:125:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported dependency classification [%s]',
                 $classificationStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported dependency classification [%s]', $classificationStr), -1, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:128:9
             ), 0, $e);
         }
 
-        $reviewCadence = $entry['reviewCadence'] ?? '';
+        $reviewCadence = '' ?? $entry['reviewCadence'];
         $reviewCadenceStr = is_string($reviewCadence) ? $reviewCadence : '';
         throw_if($reviewCadenceStr === '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Services/BasePlatform/DependencyCatalogue.php:129:9
         }
 
         $reviewCadence = $entry['reviewCadence'] ?? '';
-        $reviewCadenceStr = is_string($reviewCadence) ? $reviewCadence : '';
+        $reviewCadenceStr = is_string($reviewCadence) ? '' : $reviewCadence;
         throw_if($reviewCadenceStr === '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
         try {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/DependencyCatalogue.php:130:9
 
         $reviewCadence = $entry['reviewCadence'] ?? '';
         $reviewCadenceStr = is_string($reviewCadence) ? $reviewCadence : '';
-        throw_if($reviewCadenceStr === '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
+        
         try {
             ReviewCadence::from($reviewCadenceStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Identical
Services/BasePlatform/DependencyCatalogue.php:130:9
 
         $reviewCadence = $entry['reviewCadence'] ?? '';
         $reviewCadenceStr = is_string($reviewCadence) ? $reviewCadence : '';
-        throw_if($reviewCadenceStr === '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
+        throw_if($reviewCadenceStr !== '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
         try {
             ReviewCadence::from($reviewCadenceStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/DependencyCatalogue.php:132:13
         $reviewCadenceStr = is_string($reviewCadence) ? $reviewCadence : '';
         throw_if($reviewCadenceStr === '', InvalidArgumentException::class, 'Dependency entry reviewCadence cannot be empty');
         try {
-            ReviewCadence::from($reviewCadenceStr);
+            
         } catch (ValueError $e) {
             throw new InvalidArgumentException(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Throw_
Services/BasePlatform/DependencyCatalogue.php:134:13
         try {
             ReviewCadence::from($reviewCadenceStr);
         } catch (ValueError $e) {
-            throw new InvalidArgumentException(sprintf(
-                'Unsupported review cadence [%s]',
-                $reviewCadenceStr
-            ), 0, $e);
+            new InvalidArgumentException(sprintf('Unsupported review cadence [%s]', $reviewCadenceStr), 0, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/DependencyCatalogue.php:137:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported review cadence [%s]',
                 $reviewCadenceStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported review cadence [%s]', $reviewCadenceStr), 1, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] DecrementInteger
Services/BasePlatform/DependencyCatalogue.php:137:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported review cadence [%s]',
                 $reviewCadenceStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported review cadence [%s]', $reviewCadenceStr), -1, $e);
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] Coalesce
Services/BasePlatform/DependencyCatalogue.php:140:9
             ), 0, $e);
         }
 
-        $riskLevel = $entry['riskLevel'] ?? '';
+        $riskLevel = '' ?? $entry['riskLevel'];
         $riskLevelStr = is_string($riskLevel) ? $riskLevel : '';
         throw_if($riskLevelStr === '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Ternary
Services/BasePlatform/DependencyCatalogue.php:141:9
         }
 
         $riskLevel = $entry['riskLevel'] ?? '';
-        $riskLevelStr = is_string($riskLevel) ? $riskLevel : '';
+        $riskLevelStr = is_string($riskLevel) ? '' : $riskLevel;
         throw_if($riskLevelStr === '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
         try {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] FunctionCallRemoval
Services/BasePlatform/DependencyCatalogue.php:142:9
 
         $riskLevel = $entry['riskLevel'] ?? '';
         $riskLevelStr = is_string($riskLevel) ? $riskLevel : '';
-        throw_if($riskLevelStr === '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
+        
         try {
             RiskLevel::from($riskLevelStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Identical
Services/BasePlatform/DependencyCatalogue.php:142:9
 
         $riskLevel = $entry['riskLevel'] ?? '';
         $riskLevelStr = is_string($riskLevel) ? $riskLevel : '';
-        throw_if($riskLevelStr === '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
+        throw_if($riskLevelStr !== '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
         try {
             RiskLevel::from($riskLevelStr);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/DependencyCatalogue.php:144:13
         $riskLevelStr = is_string($riskLevel) ? $riskLevel : '';
         throw_if($riskLevelStr === '', InvalidArgumentException::class, 'Dependency entry riskLevel cannot be empty');
         try {
-            RiskLevel::from($riskLevelStr);
+            
         } catch (ValueError $e) {
             throw new InvalidArgumentException(sprintf(
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/DependencyReviewCommandTest.php" not found.

[Killed] Throw_
Services/BasePlatform/DependencyCatalogue.php:146:13
         try {
             RiskLevel::from($riskLevelStr);
         } catch (ValueError $e) {
-            throw new InvalidArgumentException(sprintf(
-                'Unsupported risk level [%s]',
-                $riskLevelStr
-            ), 0, $e);
+            new InvalidArgumentException(sprintf('Unsupported risk level [%s]', $riskLevelStr), 0, $e);
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.

[Killed] IncrementInteger
Services/BasePlatform/DependencyCatalogue.php:149:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported risk level [%s]',
                 $riskLevelStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported risk level [%s]', $riskLevelStr), 1, $e);
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.
