[Killed] DecrementInteger
Services/BasePlatform/DependencyCatalogue.php:149:13
             throw new InvalidArgumentException(sprintf(
                 'Unsupported risk level [%s]',
                 $riskLevelStr
-            ), 0, $e);
+            throw new InvalidArgumentException(sprintf('Unsupported risk level [%s]', $riskLevelStr), -1, $e);
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/DependencyCatalogueTest.php" not found.
