[Killed] NotIdentical
Services/BasePlatform/EnvironmentProfileValidator.php:38:9
     {
         $query = EnvironmentProfile::query()->where('status', 'supported');
 
-        if ($profiles !== []) {
+        if ($profiles === []) {
             /** @phpstan-ignore-next-line */
             $query->whereIn('name', $profiles);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/EnvironmentProfileValidatorTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/EnvironmentProfileValidator.php:40:13
 
         if ($profiles !== []) {
             /** @phpstan-ignore-next-line */
-            $query->whereIn('name', $profiles);
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/EnvironmentProfileValidatorTest.php" not found.
