[Killed] MethodCallRemoval
Services/BasePlatform/UnsupportedProfileException.php:13:9
 {
     public function __construct(string $profile)
     {
-        parent::__construct(sprintf('Unsupported profile [%s]', $profile));
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Feature/BasePlatform/BootstrapWorkflowTest.php" not found.
