[Killed] PublicVisibility
Services/BasePlatform/WorkflowSuiteChannelSync.php:13:5
 
 final class WorkflowSuiteChannelSync
 {
-    public function sync(): void
+    protected function sync(): void
     {
         /** @var array<string, array<int, array{channel: string, medium: string}>> $desired */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] Foreach_
Services/BasePlatform/WorkflowSuiteChannelSync.php:19:9
         $desired = Config::get('base-platform.workflow_suite_channels', []);
         $keep = [];
 
-        foreach ($desired as $suiteName => $channels) {
-            $suite = WorkflowSuite::query()->where('name', $suiteName)->first();
-
-            if ($suite === null) {
-                continue;
-            }
-
-            foreach ($channels as $channel) {
-                $record = WorkflowSuiteChannel::query()->updateOrCreate(
-                    [
-                        'workflow_suite_id' => $suite->id,
-                        'channel' => $channel['channel'],
-                        'medium' => $channel['medium'],
-                    ],
-                    []
-                );
-
-                $keep[] = $record->id;
-            }
-        }
+        foreach ([] as $suiteName => $channels) {
 
         if ($keep !== []) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] Identical
Services/BasePlatform/WorkflowSuiteChannelSync.php:22:13
         foreach ($desired as $suiteName => $channels) {
             $suite = WorkflowSuite::query()->where('name', $suiteName)->first();
 
-            if ($suite === null) {
+            if ($suite !== null) {
                 continue;
             }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] Continue_
Services/BasePlatform/WorkflowSuiteChannelSync.php:23:17
             $suite = WorkflowSuite::query()->where('name', $suiteName)->first();
 
             if ($suite === null) {
-                continue;
+                break;
             }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] Foreach_
Services/BasePlatform/WorkflowSuiteChannelSync.php:26:13
                 continue;
             }
 
-            foreach ($channels as $channel) {
-                $record = WorkflowSuiteChannel::query()->updateOrCreate(
-                    [
-                        'workflow_suite_id' => $suite->id,
-                        'channel' => $channel['channel'],
-                        'medium' => $channel['medium'],
-                    ],
-                    []
-                );
-
-                $keep[] = $record->id;
-            }
+            foreach ([] as $channel) {
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] ArrayItem
Services/BasePlatform/WorkflowSuiteChannelSync.php:29:25
             foreach ($channels as $channel) {
                 $record = WorkflowSuiteChannel::query()->updateOrCreate(
                     [
-                        'workflow_suite_id' => $suite->id,
+                        $record = WorkflowSuiteChannel::query()->updateOrCreate(['workflow_suite_id' > $suite->id, 'channel' => $channel['channel'], 'medium' => $channel['medium']], []);
                         'channel' => $channel['channel'],
                         'medium' => $channel['medium'],
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] NotIdentical
Services/BasePlatform/WorkflowSuiteChannelSync.php:40:9
             }
         }
 
-        if ($keep !== []) {
+        if ($keep === []) {
             /** @phpstan-ignore-next-line */
             WorkflowSuiteChannel::query()
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.

[Killed] MethodCallRemoval
Services/BasePlatform/WorkflowSuiteChannelSync.php:42:13
 
         if ($keep !== []) {
             /** @phpstan-ignore-next-line */
-            WorkflowSuiteChannel::query()
-                ->whereNotIn('id', $keep)
-                ->delete();
+            
         }
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/WorkflowSuiteChannelSyncTest.php" not found.
