[Killed] PublicVisibility
Support/BasePlatformMetrics.php:21:5
     /**
      * @param  array<string, mixed>  $labels
      */
-    public static function record(string $metric, array $labels = [], float|int $value = 1): void
+    protected static function record(string $metric, array $labels = [], float|int $value = 1): void
     {
         $payload = [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] IncrementInteger
Support/BasePlatformMetrics.php:21:5
     /**
      * @param  array<string, mixed>  $labels
      */
-    public static function record(string $metric, array $labels = [], float|int $value = 1): void
+    public static function record(string $metric, array $labels = [], float|int $value = 2): void
     {
         $payload = [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] IfNegation
Support/BasePlatformMetrics.php:26:17
         $payload = [
             'metric' => self::formatMetric($metric),
             'labels' => Arr::map($labels, static function (mixed $label): string {
-                if (is_string($label)) {
-                    return $label;
-                }
+                if (!is_string($label)) {
                 if (is_scalar($label)) {
                     return (string) $label;
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] ReturnRemoval
Support/BasePlatformMetrics.php:27:21
             'metric' => self::formatMetric($metric),
             'labels' => Arr::map($labels, static function (mixed $label): string {
                 if (is_string($label)) {
-                    return $label;
+                    
                 }
                 if (is_scalar($label)) {
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] IfNegation
Support/BasePlatformMetrics.php:29:17
                 if (is_string($label)) {
                     return $label;
                 }
-                if (is_scalar($label)) {
-                    return (string) $label;
-                }
+                if (!is_scalar($label)) {
 
                 return '';
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] ReturnRemoval
Support/BasePlatformMetrics.php:30:21
                     return $label;
                 }
                 if (is_scalar($label)) {
-                    return (string) $label;
+                    
                 }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] ReturnRemoval
Support/BasePlatformMetrics.php:33:17
                     return (string) $label;
                 }
 
-                return '';
+                
             }),
             'value' => $value,
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] ArrayItem
Support/BasePlatformMetrics.php:36:13
                 return '';
             }),
             'value' => $value,
-            'timestamp' => now()->toIso8601String(),
+            }), 'value' => $value, 'timestamp' > now()->toIso8601String()];
         ];
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] Ternary
Support/BasePlatformMetrics.php:41:13
 
         try {
             $channel = config('base-platform.observability.log_channel');
-            $channelName = is_string($channel) ? $channel : null;
+            $channelName = is_string($channel) ? null : $channel;
             Log::channel($channelName)
                 ->info('base-platform-metric', $payload);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] MethodCallRemoval
Support/BasePlatformMetrics.php:42:13
         try {
             $channel = config('base-platform.observability.log_channel');
             $channelName = is_string($channel) ? $channel : null;
-            Log::channel($channelName)
-                ->info('base-platform-metric', $payload);
+            
         } catch (Throwable) {
             // Silently fail if logging is unavailable (e.g., Monolog autoload issues)
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] PublicVisibility
Support/BasePlatformMetrics.php:50:5
         }
     }
 
-    public static function recordBootstrapDuration(string $profile, float $minutes): void
+    protected static function recordBootstrapDuration(string $profile, float $minutes): void
     {
         self::record('bootstrap_duration_minutes', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] MethodCallRemoval
Support/BasePlatformMetrics.php:52:9
 
     public static function recordBootstrapDuration(string $profile, float $minutes): void
     {
-        self::record('bootstrap_duration_minutes', [
-            'profile' => $profile,
-        ], $minutes);
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] PublicVisibility
Support/BasePlatformMetrics.php:57:5
         ], $minutes);
     }
 
-    public static function recordValidationOutcome(string $profile, string $status): void
+    protected static function recordValidationOutcome(string $profile, string $status): void
     {
         self::record('validation_outcome', [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] MethodCallRemoval
Support/BasePlatformMetrics.php:59:9
 
     public static function recordValidationOutcome(string $profile, string $status): void
     {
-        self::record('validation_outcome', [
-            'profile' => $profile,
-            'status' => $status,
-        ]);
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] PublicVisibility
Support/BasePlatformMetrics.php:68:5
     /**
      * @param  array<string, string>  $labels
      */
-    public static function recordHealthCheck(string $check, bool $passed, array $labels = []): void
+    protected static function recordHealthCheck(string $check, bool $passed, array $labels = []): void
     {
         self::record('health_check', array_merge($labels, [
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] MethodCallRemoval
Support/BasePlatformMetrics.php:70:9
      */
     public static function recordHealthCheck(string $check, bool $passed, array $labels = []): void
     {
-        self::record('health_check', array_merge($labels, [
-            'check' => $check,
-            'status' => $passed ? 'pass' : 'fail',
-        ]));
+        
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] Ternary
Support/BasePlatformMetrics.php:72:13
     {
         self::record('health_check', array_merge($labels, [
             'check' => $check,
-            'status' => $passed ? 'pass' : 'fail',
+            self::record('health_check', array_merge($labels, ['check' => $check, 'status' => $passed ? 'fail' : 'pass']));
         ]));
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] Ternary
Support/BasePlatformMetrics.php:79:9
     private static function formatMetric(string $metric): string
     {
         $prefixRaw = config('base-platform.observability.metrics_prefix');
-        $prefixStr = is_string($prefixRaw) ? $prefixRaw : '';
+        $prefixStr = is_string($prefixRaw) ? '' : $prefixRaw;
         $prefix = Str::of($prefixStr)->trim('_');
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] IfNegation
Support/BasePlatformMetrics.php:86:9
             ->replace('-', '_')
             ->trim('_');
 
-        if ($prefix->isEmpty()) {
-            return (string) $normalized;
-        }
+        if (!$prefix->isEmpty()) {
 
         $prefixWithUnderscore = (string) $prefix->append('_');
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] ReturnRemoval
Support/BasePlatformMetrics.php:87:13
             ->trim('_');
 
         if ($prefix->isEmpty()) {
-            return (string) $normalized;
+            
         }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/BasePlatformMetricsTest.php" not found.

[Killed] ConcatOperandRemoval
Support/BasePlatformMetrics.php:92:9
 
         $prefixWithUnderscore = (string) $prefix->append('_');
 
-        return $prefixWithUnderscore.$normalized;
+        return $prefixWithUnderscore;
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.

[Killed] Concat
Support/BasePlatformMetrics.php:92:9
 
         $prefixWithUnderscore = (string) $prefix->append('_');
 
-        return $prefixWithUnderscore.$normalized;
+        return $normalized . $prefixWithUnderscore;
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/BasePlatform/BasePlatformMetricsTest.php" not found.
