[Killed] MatchArmRemoval
Support/ThemeColorHelper.php:39:9
         }
 
         // Otherwise return the specific color requested
-        return match ($settings->accent) {
-            ThemeAccent::Blue => match ($settings->theme) {
-                Theme::Kanagawa => '#7fb4ca', // Crystal Blue
-                default => '#89b4fa', // Catppuccin Blue
-            },
-            ThemeAccent::Red => match ($settings->theme) {
-                Theme::Kanagawa => '#c34043', // Autumn Red
-                default => '#f38ba8', // Catppuccin Red
-            },
-            ThemeAccent::Green => match ($settings->theme) {
-                Theme::Kanagawa => '#76946a', // Autumn Green
-                default => '#a6e3a1', // Catppuccin Green
-            },
-        };
+        
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/ThemeColorHelperTest.php" not found.

[Killed] MatchArmRemoval
Support/ThemeColorHelper.php:40:13
 
         // Otherwise return the specific color requested
         return match ($settings->accent) {
-            ThemeAccent::Blue => match ($settings->theme) {
-                Theme::Kanagawa => '#7fb4ca', // Crystal Blue
-                default => '#89b4fa', // Catppuccin Blue
-            },
+            
             ThemeAccent::Red => match ($settings->theme) {
                 Theme::Kanagawa => '#c34043', // Autumn Red
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/ThemeColorHelperTest.php" not found.

[Killed] MatchArmRemoval
Support/ThemeColorHelper.php:44:13
                 Theme::Kanagawa => '#7fb4ca', // Crystal Blue
                 default => '#89b4fa', // Catppuccin Blue
             },
-            ThemeAccent::Red => match ($settings->theme) {
-                Theme::Kanagawa => '#c34043', // Autumn Red
-                default => '#f38ba8', // Catppuccin Red
-            },
+            
             ThemeAccent::Green => match ($settings->theme) {
                 Theme::Kanagawa => '#76946a', // Autumn Green
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/ThemeColorHelperTest.php" not found.

[Killed] MatchArmRemoval
Support/ThemeColorHelper.php:48:13
                 Theme::Kanagawa => '#c34043', // Autumn Red
                 default => '#f38ba8', // Catppuccin Red
             },
-            ThemeAccent::Green => match ($settings->theme) {
-                Theme::Kanagawa => '#76946a', // Autumn Green
-                default => '#a6e3a1', // Catppuccin Green
-            },
+            
         };
     }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/ThemeColorHelperTest.php" not found.
