[Killed] PublicVisibility
Support/TieredWorkflowPolicy.php:15:5
     /**
      * @return array<string, array<string, mixed>>
      */
-    public static function tiers(): array
+    protected static function tiers(): array
     {
         /** @var array<string, array<string, mixed>> $tiers */
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/TieredWorkflowPolicyTest.php" not found.

[Killed] ArrayOneItem
Support/TieredWorkflowPolicy.php:20:9
         /** @var array<string, array<string, mixed>> $tiers */
         $tiers = Config::get('base-platform.workflow_policy.tiers', []);
 
-        return $tiers;
+        return count($tiers) > 1 ? array_slice($tiers, 0, 1, true) : $tiers;
     }
 
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/TieredWorkflowPolicyTest.php" not found.

[Killed] PublicVisibility
Support/TieredWorkflowPolicy.php:26:5
     /**
      * @return array<int, string>
      */
-    public static function workflowsFor(string $tier): array
+    protected static function workflowsFor(string $tier): array
     {
         $workflows = Arr::get(self::tiers(), "{$tier}.workflows", []);
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/TieredWorkflowPolicyTest.php" not found.

[Killed] Ternary
Support/TieredWorkflowPolicy.php:30:9
     {
         $workflows = Arr::get(self::tiers(), "{$tier}.workflows", []);
 
-        return is_array($workflows) ? array_values(array_filter($workflows, is_string(...))) : [];
+        return is_array($workflows) ? [] : array_values(array_filter($workflows, is_string(...)));
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/TieredWorkflowPolicyTest.php" not found.

[Killed] UnwrapArrayValues
Support/TieredWorkflowPolicy.php:30:9
     {
         $workflows = Arr::get(self::tiers(), "{$tier}.workflows", []);
 
-        return is_array($workflows) ? array_values(array_filter($workflows, is_string(...))) : [];
+        return is_array($workflows) ? array_filter($workflows, is_string(...)) : [];
     }
 }
statusReason: INFO  Test file "/private/var/folders/f0/2m6r6db57bxglzky2b_f49n00000gn/T/infection/tests/Unit/Support/TieredWorkflowPolicyTest.php" not found.
